Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/about/probabilistic_programming_with_pymc/notebook.po
Languages: es

source: Webinar notebook
es: Cuaderno del webinar

source: About this talk
es: Sobre esta charla

source: Probabilistic programming from two perspectives
es: La programación probabilística desde dos perspectivas

source: Philosophical: storytelling with data
es: Filosófica: contar historias con datos

source: Mathematical: Monte Carlo methods
es: Matemáticas: Métodos Monte Carlo

source: Probabilistic programming with PyMC
es: Programación probabilística con PyMC

source: The Monty Hall problem
es: El problema de Monty Hall

source: Robust regression
es: Regresión robusta

source: Hamiltonian Monte Carlo
es: Monte Carlo hamiltoniano

source: Lego? example
es: ¿Lego? ejemplo

source: Next Steps
es: Próximos pasos

source: All the code that is shown in this webinar can be executed from its website. Therefore you have two ways to follow along:
es: Todo el código que se muestra en este webinar se puede ejecutar desde su página web. Por lo tanto, tienes dos maneras de seguirlo:

source: Click on the run code button and execute the code straight from this page
es: Haz clic en el botón de ejecutar código y ejecuta el código directamente desde esta página

source: Clone the GitHub repo: [pymc-devs/pymc-data-umbrella](https://github.com/pymc-devs/pymc-data-umbrella) and follow along locally using Jupyter
es: Clona el repositorio de GitHub: [pymc-devs/pymc-data-umbrella](https://github.com/pymc-devs/pymc-data-umbrella) y síguelo localmente usando Jupyter

source: Philosophical
es: Filosófica

source: (Classical) Data science —— inference enables story telling
es: (Clásica) Ciencia de datos —— la inferencia permite contar historias

source: Probabilistic programming —— story telling enables inference
es: Programación probabilística —— contar historias permite hacer inferencias

source: Bayesian inference —— quantifying uncertainty
es: Inferencia Bayesiana —— cuantificando la incertidumbre

source: Mathematical
es: Matemática

source: Monte Carlo methods
es: Métodos de Monte Carlo

source: Monte Carlo methods —— approximating (intractible) integrals
es: Métodos de Monte Carlo —— apróximando integrales difíciles de manejar

source: Bayes' Theorem —— (often) intractible integrals
es: Teorema de Bayes —— (a menudo) integrales difíciles de manejar

source: Forcing <span style="color:red;">this term</span> to be analytically tractible drastically limits the richness of the models we can consider.
es: Forzar<span style="color:red;">este término </span> a ser manejable analíticamente limita drásticamente la riqueza de los modelos que podemos considerar.

source: Probabilistic Programming with PyMC
es: Programación probabilística con PyMC

source: The Monty Hall Problem
es: El problema de Monty Hall

source: Mathematical solution
es: Solución matemática

source: \begin{align*} P(\text{Behind 1}\ |\ \text{Opened 3}) & = \frac{P(\text{Opened 3}\ |\ \text{Behind 1}) \cdot P(\text{Behind 1})}{P(\text{Opened 3})} \\ P(\text{Opened 3}) & = P(\text{Opened 3}\ |\ \text{Behind 1}) \cdot P(\text{Behind 1}) \\ & \ \ \ \ + P(\text{Opened 3}\ |\ \text{Behind 2}) \cdot P(\text{Behind 2}) \\ & \ \ \ \ + P(\text{Opened 3}\ |\ \text{Behind 3}) \cdot P(\text{Behind 3}) \\ & = \frac{1}{2} \cdot \frac{1}{3} + 1 \cdot \frac{1}{3} + 0 \cdot \frac{1}{3} = \frac{1}{2} \\ P(\text{Behind 1}\ |\ \text{Opened 3}) & = \frac{\frac{1}{2} \cdot \frac{1}{3}}{\frac{1}{2}} = \frac{1}{3} \end{align*}
es: \begin{align*} P(\text{Behind 1}\ |\ \text{Se abrió la 3}) & = \frac{P(\text{Se abrió la 3}\ |\ \text{Detrás de 1}) \cdot P(\text{Behind 1})}{P(\text{Se abrió la 3})} \\ P(\text{Se abrió la 3}) & = P(\text{Se abrió la 3}\ |\ \text{Detrás de 1}) \cdot P(\text{Detrás de 1}) \\ & \ \ \ \ + P(\text{Se abrió la 3}\ |\ \text{Detrás de 2}) \cdot P(\text{Detrás de 2}) \\ & \ \ \ \ + P(\text{Se abrió la 3}\ |\ \text{Detrás de 3}) \cdot P(\text{Detrás de 3}) \\ & = \frac{1}{2} \cdot \frac{1}{3} + 1 \cdot \frac{1}{3} + 0 \cdot \frac{1}{3} = \frac{1}{2} \\ P(\text{Detrás de 1}\ |\ \text{Se abrió la 3}) & = \frac{\frac{1}{2} \cdot \frac{1}{3}}{\frac{1}{2}} = \frac{1}{3} \end{align*}

source: PyMC solution
es: Solución con PyMC

source: Initially, we have no information about which door the prize is behind.
es: En un principio, no tenemos información sobre detrás de qué puerta se encuentra el premio.

source: If we choose the first door:
es: Si escogemos la primera puerta:

source: Monty opened the third door, revealing a goat.
es: Monty abrió la tercera puerta y descubrió una cabra.

source: Two key components
es: Dos componentes clave

source: [PyMC distributions](https://docs.pymc.io/en/latest/api/distributions.html)
es: [Distribuciones de PyMC](https://docs.pymc.io/en/latest/api/distributions.html)

source: Aesara is a Python library that allows you to define, optimize, and evaluate mathematical expressions involving multi-dimensional arrays efficiently. Aesara features:
es: Aesara es una librería de Python que permite definir, optimizar y evaluar de forma eficiente expresiones matemáticas que involucran arreglos multi-dimensionales. Aesara tiene:

source: Tight integration with NumPy – Use numpy.ndarray in Aesara-compiled functions.
es: Una integración fuerte con NumPy — se pueden usar arreglos numpy.ndarray en funciones compiladas por Aesara.

source: **Efficient symbolic differentiation – Aesara does your derivatives for functions with one or many inputs.**
es: **Diferenciación simbólica eficiente - Aesara hace por ti las derivadas de funciones con una o más variables de entrada.**

source: Speed and stability optimizations – Get the right answer for log(1+x) even when x is really tiny.
es: Optimizaciones para mayor velocidad y estabilidad - Obtén la respuesta correcta para log(1+x) incluso cuando x es muy pequeño.

source: Dynamic C/JAX/Numba code generation – Evaluate expressions faster.
es: Generación dinámica de código de C/JAX/Numba - Evalúa expresiones más rápido.

source: Aesara is based on Theano, which has been powering large-scale computationally intensive scientific investigations since 2007.
es: Aesara se basa en Theano, una librería que ha servido de apoyo para investigaciones científicas computacionalmente intensivas y de gran escala desde 2007.

source: Robust Regression
es: Regresión robusta

source: [Anscombe's quartet](https://en.wikipedia.org/wiki/Anscombe%27s_quartet)
es: [El cuarteto de Anscombe](https://en.wikipedia.org/wiki/Anscombe%27s_quartet)

source: This code for plotting Anscombe's quartet is adapted from the [`matplotlib` documentation](https://matplotlib.org/stable/gallery/specialty_plots/anscombe.html).
es: El código para graficar el cuarteto de Anscombe fue adaptado de la [documentación de `matplotlib`](https://matplotlib.org/stable/gallery/specialty_plots/anscombe.html).

source: Ordinary least squares
es: Mínimos cuadrados ordinarios

source: **Assumption:** All values of $m, b \in \mathbb{R}$, $\sigma > 0$ are equally likely
es: **Presunción:** Todos los valores de $m, b \in \mathbb{R}$, $\sigma > 0$ son igualmente verosímiles

source: This is equivalent to
es: Esto es equivalente a

source: Two more key components
es: Otros dos componentes clave

source: ArviZ is a Python package for exploratory analysis of Bayesian models. Includes functions for posterior analysis, data storage, sample diagnostics, model checking, and comparison.
es: ArviZ es un paquete de Python para el análisis exploratorio de modelos Bayesianos. Incluye funciones para el análisis posterior, almacenamiento de datos, diagnósticos de muestras, verificación de modelos y comparaciones.

source: The goal is to provide backend-agnostic tools for diagnostics and visualizations of Bayesian inference in Python, by first converting inference data into xarray objects. See here for more on **xarray** and ArviZ usage and here for more on InferenceData structure and specification.
es: La meta es proporcionar herramientas agnósticas al backend para diagnosticar y visualizar inferencias Bayesianas en Python, a partir de datos convertidos en objetos xarray. Revisa aquí si necesitas más información sobre **xarray** y el uso de ArviZ y aquí para más información sobre la estructura y especificación de InferenceData.

source: xarray (formerly xray) is an open source project and Python package that makes working with labelled multi-dimensional arrays simple, efficient, and fun!
es: xarray (antes conocido como xray) es un proyecto de código abierto y un paquete de Python que hacen más simple, eficiente y divertido el trabajar con arreglos multi-dimensionales etiquetados.

source: Xarray is inspired by and borrows heavily from pandas, the popular data analysis package focused on labelled tabular data. It is particularly tailored to working with netCDF files, which were the source of xarray’s data model, and integrates tightly with dask for parallel computing.
es: Xarray se inspira y bebe considerablemente de pandas, el popular paquete de análisis de datos centrado en datos tabulares etiqeutados. Está diseñado en particular para trabajar con archivos netCDF, que son la fuente del modelo de datos de xarray, y se integra fuertemente con el uso de dask para computaciones paralelas.

source: Ridge regression
es: Regresión ridge

source: Ridge regression is equivalent to normal priors on $m$ and $b$.
es: La regresión ridge es equivalente a asumir probabilidades a priori normales respecto a $m$ y $b$.

source: [Student's t-distribution](https://en.wikipedia.org/wiki/Student%27s_t-distribution) has fatter tails than the normal distribution.
es: [La distribución t de Student](https://en.wikipedia.org/wiki/Student%27s_t-distribution) tiene colas más gruesas que la distribución normal.

source: A Student t-likelihood is less sensitive to outliers
es: Una verosimilitud t de Student es menos sensible a datos atípicos

source: Bayesian inference ⇔ Differential geometry
es: Inferencia Bayesiana ⇔ Geometría diferencial

source: The Curse of Dimensionality
es: La maldición de la dimensionalidad

source: Automating calculus with `aesara`
es: Automatizando el cálculo con `aesara`

source: A Bayesian Analysis of Lego Prices
es: Un análisis Bayesiano de los precios de Lego

source: Scraped from [Brickset](https://brickset.com/)
es: Obtenido de [Brickset](https://brickset.com/)

source: Price model
es: Modelo de precios

source: \log \text{Price} \approx (\text{Year intercept}) + (\text{Theme intercept}) + \left((\text{Year slope}) + (\text{Theme slope})\right) \cdot \log \text{Pieces}
es: \log \text{Precio} \approx (\text{intercepto del año}) + (\text{intercepto de la temática}) + \left((\text{pendiente del año}) + (\text{pendiente de la temática})\right) \cdot \log \text{Piezas}

source: Why _Hamiltonian_ Monte Carlo?
es: ¿Por qué usar un Monte Carlo _Hamiltoniano_?

source: This model has
es: Este modelo tiene

source: parameters
es: parámetros

source: To get the same effective sample size as adaptive HMC (NUTS) with Metropolis-Hastings would required approximately
es: Obtener el mismo tamaño de muestra efectivo que en el HMC (NUTS) con el algoritmo de Metropolis-hasting requeriría apróximadamente

source: hours.
es: horas.

source: Is Darth Vader's Meditation Chamber priced fairly?
es: ¿Tiene un precio justo la cámara de meditación de Darth Vader?

source: Next steps
es: Próximos pasos

source: Thank you!
es: ¡Gracias!
