Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/CODE_OF_CONDUCT.po
Languages: es

source: Code of Conduct
es: Código de Conducta

source: Be kind to others. Do not insult or put down others. Behave professionally. Remember that harassment and sexist, racist, or exclusionary jokes are not appropriate for PyMC - Data Umbrella events being held.
es: Se amable con otras personas. No insultes ni menosprecies a las demás personas. Compórtate profesionalmente. Recuerda que el acoso y las bromas sexistas, racistas o excluyentes no son apropiadas para los eventos de PyMC - Data Umbrella que se celebren.

source: All communication should be appropriate for a professional audience including people of many different backgrounds. Sexual language and imagery is not appropriate.
es: Toda la comunicación debe ser apropiada para una audiencia profesional que incluya personas de diferentes orígenes. El lenguaje y las imágenes sexuales no son apropiados.

source: We are dedicated to providing a harassment-free community for everyone, regardless of gender, sexual orientation, gender identity and expression, disability, physical appearance, body size, race, or religion. We do not tolerate harassment of community members in any form.
es: Tenemos dedicación a brindar una comunidad libre de acoso para todas las personas, independientemente de su género, orientación sexual, identidad y expresión de género, discapacidad, apariencia física, tamaño corporal, raza o religión. No toleramos el acoso de las personas pertenecientes a la comunidad de ninguna forma.

source: Thank you for helping make this a welcoming, friendly community for all.
es: Gracias por ayudar a hacer de esta una comunidad acogedora y amistosa para todas las personas.

source: For the complete version of the code of conduct refer to [NUMFOCUS code of conduct](https://numfocus.org/code-of-conduct)
es: Para obtener la versión completa del código de conducta, consulta [el código de conducta de NUMFOCUS](https://numfocus.org/code-of-conduct)

source: Reporting
es: Reportando

source: If you believe someone is violating the code of conduct, please report this in a timely manner. Code of conduct violations reduce the value of the community for everyone and we take them seriously.
es: Si crees que alguien está violando el código de conducta, infórmalo de manera oportuna. Las violaciones del código de conducta reducen el valor de la comunidad para todas las personas y las tomamos en serio.

source: An anonymous report form is available at [https://numfocus.typeform.com/to/ynjGdT](https://numfocus.typeform.com/to/ynjGdT)
es: Un formulario de informe anónimo está disponible en [https://numfocus.typeform.com/to/ynjGdT](https://numfocus.typeform.com/to/ynjGdT)

source: You can also make a personal report by email to organizers at [info@dataumbrella.org](mailto:info@dataumbrella.org), they will respond promptly.
es: También puedes enviar un informe personal por correo electrónico al equipo organizador a [info@dataumbrella.org](mailto:info@dataumbrella.org), el equipo responderá a la brevedad.
