Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/2022-07_sprint/schedule.po
Languages: es, pt

source: PyMC-Data Umbrella Open Source Working Session
es: PyMC-Data Umbrella Open Source Sesion de Trabajo
pt: Sessão de trabalho de código aberto PyMC-Data Umbrella

source: Schedule
es: Programa
pt: Agendar

source: To take part in the upcoming Open Source Working Sessions you should:
es: Para participar en las próximas sesiones de trabajo de Open Source debes:
pt: Para participar das próximas Sessões de Trabalho de Código Aberto, você deve:

source: Fill the registration form: {bdg-link-primary-line}`https://tinyurl.com/du-pymc-os-ws`
es: Llenar el formulario de inscripción: {bdg-link-primary-line}`https://tinyurl.com/du-pymc-os-ws`
pt: Preencha o formulário de inscrição: {bdg-link-primary-line}`https://tinyurl.com/du-pymc-os-ws`

source: RSVP on MeetUp for the events you will be attending (links on table below)
es: Confirmar en MeetUp los eventos a los que asistirás (los enlaces en la tabla de abajo)
pt: Confirme presença no MeetUp para os eventos dos quais você participará (links na tabela abaixo)

source: Note: It is *not required* to attend a specific session as a prerequisite for other sessions. Ideally, it is beneficial if folks can attend as many sessions as they can, to build up their open source skills and familiarity with the PyMC project.
es: Nota: No es *obligatorio* asistir a una sesión específica como prerrequisito para otras sesiones. Lo ideal sería que las personas asistieran a tantas sesiones como pudieran, para aumentar sus conocimientos de código abierto y su familiaridad con el proyecto PyMC.
pt: Observação: *não é necessário* participar de uma sessão específica como pré-requisito para outras sessões. Idealmente, é benéfico se as pessoas puderem participar de quantas sessões puderem, para desenvolver suas habilidades de código aberto e familiaridade com o projeto PyMC.

source: Event
es: Evento
pt: Evento

source: Date
es: Fecha
pt: Data

source: Time
es: Hora
pt: Hora

source: Duration
es: Duración
pt: Duração

source: Open Source Pre-series Office Hours
es: Horas de oficina previas a la serie de código abierto
pt: Horário de atendimento da pré-série de código aberto

source: Jul 2 (Saturday)
es: 2 de julio (sábado)
pt: 2 de julho (Sábado)

source: 9 ET / 13 UTC / 16 EAT
pt: 9 ET / 13 UTC / 16 EAT / 10 BRASÍLIA

source: 1 hour
es: 1 hora
pt: 1 hora

source: Open Source Working Session #1
es: Sesión de trabajo sobre código abierto #1
pt: Sessão de trabalho de código aberto nº 1

source: Jul 9 (Saturday)
es: 9 de julio (sábado)
pt: 9 de julho (Sábado)

source: 3 hours
es: 3 horas
pt: 3 horas

source: Open Source Working Session #2
es: Sesión de trabajo sobre código abierto #2
pt: Sessão de trabalho de código aberto nº 2

source: Jul 22 (Friday)
es: 22 de julio (viernes)
pt: 22 de julho (Sexta-Feira)

source: 12 ET / 16 UTC / 19 EAT
pt: 12 ET / 16 UTC / 19 EAT / 13 BRASÍLIA

source: Open Source Working Session #3 [^1]
es: Sesión de trabajo sobre código abierto #3 [^1]
pt: Sessão de trabalho de código aberto nº 3 [^1]

source: Aug 4/5 (Thur/Fri)
es: 4/5 de agosto (jueves/viernes)
pt: 4/5 de agosto (Quinta/Sexta)

source: 19 ET / 23 UTC
pt: 19 ET / 23 UTC / 20 BRASÍLIA

source: Open Source Post-series Office Hours [^1]
es: Horas de oficina Post-serie de código abierto [^1]
pt: Horário comercial pós-série de código aberto [^1]

source: Aug 18 (Saturday)
es: 18 de agosto (sábado)
pt: 18 de agosto (Sábado)

source: Schedule with Timezones
es: Programación con husos horarios
pt: Agendar com fusos horários

source: Note: You can click on the table image below to view the full spreadsheet with a larger view.
es: Nota: Puedes hacer clic en la imagen de la tabla para ver la hoja de cálculo completa con una vista ampliada.
pt: Nota: Você pode clicar na imagem da tabela abaixo para visualizar a planilha completa com uma visão maior.

source: schedule with timezones
es: programación con husos horarios
pt: agendar com fusos horários

source: Exportable calendar
es: Calendario exportable
pt: Calendário exportável

source: Asia-Pacific timeslot
es: Horario Asia-Pacífico
pt: Intervalo de tempo Ásia-Pacífico

source: RSVP
es: Confirmación de asistencia

source: [![schedule with timezones](../_static/images/2022_07_timezones.png)](https://docs.google.com/spreadsheets/d/1oO9OhsTh9PFcqKI7Exj_ZcH0GvunQVHtM4aqUh0kjTk/edit?usp=sharing)
es: [![Programa con zonas horarias](../_static/images/2022_07_timezones.png)](https://docs.google.com/spreadsheets/d/1oO9OhsTh9PFcqKI7Exj_ZcH0GvunQVHtM4aqUh0kjTk/edit?usp=sharing)
