Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/2022-02_sprint/index.po
Languages: es, pt

source: Feb 2022 sprint
es: Sprint: Febrero del 2022
pt: Sprint de fevereiro 2022

source: Name of Event
es: Nombre del evento
pt: Nome do Evento

source: Date of Event
es: Fecha del evento
pt: Data do Evento

source: Time of Event
es: Hora del evento
pt: Hora do Evento

source: Duration
es: Duración
pt: Duração

source: Speaker
es: Orador
pt: Orador

source: Registration form
es: Formulario de registro
pt: Formulário de registro

source: November 11, 2021
es: Noviembre 11, 2021
pt: 11 de novembro de 2021

source: 5pm UTC
pt: 17:00 UTC

source: 60+30 minutes
es: 60+30 minutos
pt: 60+30 minutos

source: January 11, 2022
es: Enero 11, 2022
pt: 11 de janeiro de 2022

source: 45 minutes
es: 45 minutos
pt: 45 minutos

source: January 28, 2022
es: Enero 28, 2022
pt: 28 de Janeiro de 2022

source: February 8, 2022
es: Febrero 8, 2022
pt: 8 de Fevereiro de 2022

source: [Example PR to PyMC](https://www.youtube.com/watch?v=NbmdFJsnuuo)
es: [Ejemplo de una Solicitud de Cambios a PyMC](https://www.youtube.com/watch?v=NbmdFJsnuuo)
pt: [Exemplo PR para PyMC](https://www.youtube.com/watch?v=NbmdFJsnuuo)

source: 20 minutes
es: 20 minutos
pt: 20 minutos

source: [Bayesian Modeling with PyMC3](https://www.youtube.com/watch?v=6dc7JgR8eI0)[^2]
es: [Modelado Bayesiano con PyMC3](https://www.youtube.com/watch?v=6dc7JgR8eI0)[^2]
pt: [Modelagem bayesiana com PyMC3](https://www.youtube.com/watch?v=6dc7JgR8eI0)[^2]

source: Sprint events
es: Eventos Sprint
pt: Eventos de sprint

source: February 11, 2022
es: Febrero 11, 2022
pt: 11 de fevereiro de 2022

source: 3pm UTC
pt: 15:00 UTC

source: 1 hours
es: 1 hora
pt: 1 hora

source: [meetup event](https://www.meetup.com/data-umbrella/events/283765923/)
es: [evento en Meetup](https://www.meetup.com/data-umbrella/events/283765923/)
pt: [evento de encontro](https://www.meetup.com/data-umbrella/events/283765923/)

source: Sprint slot 1
es: Sprint: 1 espacio
pt: Espaço de sprint 1

source: February 18, 2022
es: Febrero 18, 2022
pt: 18 de fevereiro de 2022

source: 7pm UTC
pt: 19:00 UTC

source: 2 hours
es: 2 horas
pt: 2 horas

source: [meetup event](https://www.meetup.com/data-umbrella/events/283178769/)
es: [evento en Meetup](https://www.meetup.com/data-umbrella/events/283178769/)
pt: [Evento de meetup](https://www.meetup.com/data-umbrella/events/283178769/)

source: Sprint slot 2
es: Sprint: 2 espacio
pt: Espaço de sprint 2

source: February 19, 2022
es: Febrero 19, 2022
pt: 19 de fevereiro de 2022

source: 10am UTC
pt: 10:00 UTC

source: Post Sprint
pt: Pós Sprint

source: February 25, 2022
es: Febrero 25, 2022
pt: 25 de fevereiro de 2022

source: [meetup event](https://www.meetup.com/data-umbrella/events/283766699/)
es: [evento en Meetup](https://www.meetup.com/data-umbrella/events/283766699/)
pt: [evento de meetup](https://www.meetup.com/data-umbrella/events/283766699/)

source: Only for people who need additional help with python, but are already familiar with at least one programming language
es: Solo para personas que necesiten ayuda adicional con python, pero que ya están familiarizadas con al menos un lenguaje de programación.
pt: Apenas para pessoas que precisam de ajuda adicional com python, mas já estão familiarizadas com pelo menos uma linguagem de programação

source: This is an old (but useful) resource, it uses PyMC3, check {ref}`contributing_to_pymc` for an introduction to PyMC 4.0
es: Este es un recurso viejo (pero útil), usa PyMC3, revisa {ref}`contributing_to_pymc` para una introducción a PyMC 4.0
pt: Este é um recurso antigo (mas útil), ele usa PyMC3, verifique {ref}`contributing_to_pymc` para uma introdução ao PyMC 4.0

source: Webinars
es: Seminario Web
