Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/2023-03_sprint/index.po
Languages: es

source: March 2023 Open Source Working Session: Latin America
es: Sesión de trabajo Open Source Marzo 2023: América Latina

source: This event is an online hands-on working session to contribute to PyMC, a Python probabilistic programming language. Knowledge of PyMC is not required, and it is beginner-friendly. There is a range of possible contributions, from adding timestamps to videos, to documentation, to running Jupyter notebooks in the latest version of PyMC, to more advanced code contributions.
es: Este evento es una sesión de trabajo práctica y online para contribuir a PyMC, un lenguaje de programación probabilístico. No se requiere conocimiento previo sobre PyMC y es apto para principiantes. El rango de contribuciones posibles es muy amplio, des de añadir marcas de tiempo a vídeos, contribuir a la documentación, ejecutar notebooks de Jupyter con la versión más reciente de PyMC, hasta contribuciones de código.

source: This event is focused on the LATAM region. However, we welcome folks from all regions. Please indicate on the registration form if you will need a translator.
es: Este evento se focaliza en América Latina. Sin embargo, gente de cualquier región es bienvenida. Por favor, marcad en el formulario de inscripción se necesitáis a alguien que os traduzca.

source: Volunteers: If you are available on the event day to be a translator for Spanish or Portuguese, please contact us ({{ du_email }}). To contribute to the website translations, please see {ref}`translations`.
es: Voluntarios: Si está disponible el día del evento para traducir del Español o Portugués, contacta con nosotros ({{ du_email }}). Para ayudar con la traducción de la web, por favor vea {ref}`translations`.

source: Inspirational Tips on Contributing to Open Source
es: Consejos inspiradores para contribuir al código abierto

source: Check out this 3-minute video by [Mariatta Wijaya](https://www.linkedin.com/in/mariatta/). She has been a Python core developer since 2017, and she shares a few inspirational remarks for those beginning or continuing their journey in contributing to open source.
es: Mire este video de 3 minutos de [Mariatta Wijaya] (https://www.linkedin.com/in/mariatta/). Ha sido desarrolladora principal de Python desde 2017 y comparte algunos comentarios inspiradores para aquellos que comienzan o continúan su viaje para contribuir con el código abierto.

source: "I wish someone had told me earlier how amazing open source is and I had become involved earlier."
es: "Ojalá alguien me hubiera dicho antes lo increíble que es el código abierto y me hubiera involucrado antes".

source: Participating in and influencing decisions in the open source community is important.
es: Es importante participar e influir en las decisiones de la comunidad de código abierto.

source: Open source lets us learn about: continuous integration, unit tests, documentation, packaging
es: El código abierto nos permite aprender sobre: integración continua, pruebas unitarias, documentación, empaquetado

source: Schedule
es: Programa

source: To take part in the upcoming Open Source Working Sessions you should:
es: Para participar en las próximas sesiones de trabajo de código abierto, debes:

source: Complete the registration form:
es: Completa el formulario de registro:

source: English: {bdg-link-primary-line}`https://forms.gle/YfbGnaTEQUrFVGK89`
es: Inglés: {bdg-link-primary-line}`https://forms.gle/YfbGnaTEQUrFVGK89`

source: Spanish: needs to be translated
es: Español: necesita ser traducida

source: Portuguese: needs to be translated
es: Portugués: necesita ser traducida

source: RSVP on MeetUp for the event: {bdg-link-primary-line}`https://www.meetup.com/data-umbrella/events/291768545/`
es: Confirma tu asistencia en MeetUp para el evento: {bdg-link-primary-line}`https://www.meetup.com/data-umbrella/events/291768545/`

source: Event
es: Evento

source: Date
es: Fecha

source: Time
es: Hora

source: Duration
es: Duración

source: RSVP
es: Confirmación de asistencia

source: Open Source Working Session
es: Sesión de trabajo de código abierto

source: Mar 30, 2023 (Th)
es: Marzo 30, 2023 (Jueves)

source: 3 hours
es: 3 horas

source: Monthly Open Source Contributing Sessions
es: Sesiones mensuales de contribución de código abierto

source: We have monthly open source contributing sessions, referred to as "PyMC Study Sessions". We plan to invite people who attend this event and begin work on a pull request. Please indicate on the registration form if you would like to join these sessions.
es: Tenemos sesiones mensuales de contribución de código abierto, denominadas "Sesiones de estudio de PyMC". Planeamos invitar a las personas que asisten a este evento y comenzar a trabajar en un Pull-Reuest. Indica en el formulario de inscripción si deseas participar en estas sesiones.

source: Schedule with Timezones
es: Programa con zonas de horario

source: Note: You can click on the table image below to view the full spreadsheet with a larger view.
es: Nota: Puedes hacer clic en la imagen de la tabla para ver la hoja de cálculo completa con una vista ampliada.

source: [NEED TO UPDATE]
es: [NECESITA ACTUALIZACIÓN]

source: Calendar
es: Calendario

source: Note: Once you RSVP to the Meetup event, it can be added to your calendar that way as well.
es: Nota: Una vez que confirmes tu asistencia al evento Meetup, también puedes agregarlo a tu calendario de esa manera.
