Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/contributing/tutorials/docstring_tutorial.po
Languages: es

source: Your first contribution to PyMC
es: Tu primera contribución a PyMC

source: This tutorial will guide you in submitting your first {abbr}`PR (Pull Request)` to the [pymc](https://github.com/pymc-devs/pymc) repository. We have tried to cover all of the steps and to be clear with the expected result at each step is.
es: Este tutorial te guiará en el envío de tu primer {abbr}`PR (Pull Request)` al repositorio [pymc](https://github.com/pymc-devs/pymc). Hemos tratado de cubrir todos los pasos y ser claros con el resultado esperado en cada uno de ellos.

source: You will start cloning the pymc repository, installing the requirements you'll need to contribute, making some changes to a docstring of your choice and submitting a pull request.
es: Empezarás clonando el repositorio pymc, instalando los requisitos que necesitarás para contribuir, haciendo algunos cambios en una cadena de documentación de tu elección y enviando un pull request.

source: Disclaimer
es: Descargo de responsabilidad

source: This is a tutorial as defined in [diataxis](https://diataxis.fr/tutorials/). Here are some things to take into account:
es: Se trata de un tutorial tal y como se define en [diataxis](https://diataxis.fr/tutorials/). Aquí hay algunas cosas a tener en cuenta:

source: **Do I need to follow each step exactly as explained?** No, but we strongly recommend you follow them. Once you have submitted your first PR and feel comfortable with the process then you can start experimenting and making it your own.
es: **¿Tengo que seguir cada paso exactamente como se explica?** No, pero te recomendamos encarecidamente que los sigas. Una vez que hayas enviado tu primer PR y te sientas cómodo con el proceso, puedes empezar a experimentar y personalizarlo.

source: **Do I need to submit a docstring edit as my first PR?** No, but again, we strongly recommend you do. This will allow you to separate the contribution workflow from the contribution content. We will be able to help you out along the process much better if you follow these steps, as we'll have a clear idea of where you stand at all times. We believe this will help you get comfortable with the tooling and infrastructure (git, virtual environments, GitHub PRs and {abbr}`CI (Continuous Integration)`) as quickly as possible so you can then focus on the content of your next PRs.
es: **¿Debo enviar una edición de la cadena de documentación como primer PR?** No, pero te recomendamos encarecidamente que lo hagas. Esto te permitirá separar el flujo de trabajo de la contribución del contenido de la contribución. Podremos ayudarte mucho mejor a lo largo del proceso si sigues estos pasos, ya que tendremos una idea clara de tu situación en todo momento. Creemos que esto te ayudará a sentirte cómodo con las herramientas y la infraestructura (git, entornos virtuales, GitHub PRs y {abbr}`CI (Integración Continua)`) lo antes posible para que luego puedas centrarte en el contenido de tus próximos PRs.

source: **Will I understand the reasons for each step?** No, the goal of this tutorial is to teach you to do and through doing.
es: **¿Comprenderé las razones de cada paso?** No, el objetivo de este tutorial es enseñarte a hacer a través del hacer.

source: If you prefer video to written content you can watch {ref}`Reshama <organizers>` go over this guide and submit a PR to PyMC in the following video:
es: Si prefieres vídeo en lugar de contenido escrito, puedes ver a {ref}`Reshama<organizers>` repasar esta guía y enviar un PR a PyMC en el siguiente vídeo:

source: Prepare your environment
es: Prepara tu entorno virtual

source: If you don't have your system configured yet, you can follow the instructions in the {ref}`environment_setup` tutorial.
es: Si aún no tienes configurado tu sistema, puedes seguir las instrucciones del tutorial {ref}`environment_setup`.

source: Choose a docstring
es: Escoge una cadena de documentación

source: Go to the [PyMC API documentation](https://www.pymc.io/projects/docs/en/latest/api.html), click on the module (and submodule if needed) that calls you the most and choose a docstring on which to work.
es: Ve a [la documentación de la API de PyMC API](https://www.pymc.io/projects/docs/en/latest/api.html), haz clic en el módulo (y submódulo si es necesario) que más te interese y elige una cadena de documentación (docstring) sobre el que trabajar.

source: This tutorial follows the process of updating `pymc.Uniform` and pairs general comments about updating docstrings with specific comments about applying those changes to `pymc.Uniform`.
es: Este tutorial sigue el proceso de actualización de `pymc.Uniform` y combina comentarios generales sobre la actualización de cadenas de documentación con comentarios específicos sobre la aplicación de esos cambios a `pymc.Uniform`.

source: The docstring is available at the {ref}`sample_docstring` page, I updated the docstring in PyMC while writing this guide.
es: La cadena de documentación está disponible en la página {ref}`sample_docstring`, he actualizado la cadena de documentación en PyMC mientras escribía esta guía.

source: Once you have chosen, go to our [issue tracker](https://github.com/pymc-devs/pymc/issues/5459), check nobody is already working on it and comment that you are going to update it.
es: Una vez que hayas elegido, ve a nuestro [issue tracker](https://github.com/pymc-devs/pymc/issues/5459), comprueba que nadie esté trabajando ya en ello y comenta que vas a actualizarlo.

source: Remember that function and keep the tab open (or save the link for later)
es: Recuerda esa función y mantén la pestaña abierta (o guarda el enlace para más tarde)

source: Open the file with your text editor
es: Abre el archivo con tu editor de texto

source: Open the file containing the docstring you chose to edit with your text editor. The file will be inside the `pymc` folder, but it probably won't be straightforward to guess just from the name of the function or class.
es: Abre el archivo que contiene la cadena de documentación que elegiste para editar con tu editor de texto. El archivo estará dentro de la carpeta `pymc`, pero probablemente no será fácil de adivinar solo por el nombre de la función o clase.

source: Go back to the API page and click on the "[source]" button at the right of the call signature.
es: Vuelve a la página de la API y haz clic en el botón "[source]" a la derecha de la firma de la función.

source: Now take a look at the url. Here is what it shows for {class}`pymc.Uniform`:
es: Ahora échale un vistazo al enlace. Esto es lo que muestra para {class}`pymc.Uniform`:

source: The file with the definition of the `Uniform` class and its docstring is `pymc/distributions/continuous.py`, the path that comes after `_modules` with a `.py` extension.
es: El archivo con la definición de la clase `Uniform` y su cadena de docuemntación es `pymc/distributions/continuous.py`, la ruta que viene después de `_modules` con extensión `.py`.

source: Edit the docstring
es: Edita la cadena de documentación

source: The changes you have to do are making sure that the docstring is following [numpydoc](https://numpydoc.readthedocs.io/en/latest/format.html#sections) convention. We have some extra conventions on top of that, which I have explained here but they are only relevant for some sections, most of the time you'll follow numpydoc directly.
es: Los cambios que tienes que hacer son asegurarte de que la cadena de documentación sigue la convención de [numpydoc](https://numpydoc.readthedocs.io/en/latest/format.html#sections). Tenemos algunas convenciones adicionales, que he explicado aquí, pero solo son relevantes para algunas secciones, la mayor parte del tiempo seguirás numpydoc directamente.

source: Open the [numpydoc style guide](https://numpydoc.readthedocs.io/en/latest/format.html#sections) side by side or in a different window. I am updating the docstring of {ref}`pymc.Uniform <sample_docstring>` as an example.
es: Abre la [guía de estilo numpydoc](https://numpydoc.readthedocs.io/en/latest/format.html#sections) una al lado de la otra o en una ventana diferente. Estoy actualizando la cadena de documentación de {ref}`pymc.Uniform <sample_docstring>` como ejemplo.

source: You have to review section by section to make sure everything is well documented. If you have chosen a class that is not a distribution (unlike this example where we are working on the `pymc.Uniform` distribution), you should review the docstrings of all the methods (only if they already exist though, no need to write missing docstrings). Otherwise, you should work only on the function or class docstring. We will therefore ignore the docstrings of the `logcdf`, `get_moment` and `dist` methods.
es: Tienes que revisar sección por sección para asegurarte de que todo está bien documentado. Si has elegido una clase que no es una distribución (a diferencia de este ejemplo en el que estamos trabajando en la distribución `pymc.Uniform`), debes revisar las cadenas de documentación de todos los métodos (aunque solo si ya existen, no es necesario escribir las cadenas de documentación que faltan). De lo contrario, deberías trabajar solo en la cadena de documentación de la función o de la clase. Por lo tanto, ignoraremos las cadenas de documentación de los métodos `logcdf`, `get_moment` y `dist`.

source: Section independent comments
es: Comentarios que no están relacionados con ninguna sección

source: Only the short summary section is required. The rest should be used when relevant. As a rule, if a section is missing, ignore it for now. If you think it should be added, take a note and let us know when you open the PR.
es: Solo es necesario un breve resumen. El resto debe utilizarse cuando sea pertinente. Por regla general, si falta una sección, ignórala por ahora. Si crees que debería añadirse, toma nota y comunícalo cuando abras el PR.

source: If you find instances of the plot directive `.. plot::`, make sure they are either on the extended summary or examples section and that they use the `close-figs` context. It should look like:
es: Si encuentras instancias de la directiva para graficar `..plot::`, asegúrate de que estén ya sea en el resumen extendido o en la sección de ejemplos y de que usen el contexto `close-figs`. Debería lucir así:

source: Short summary
es: Breve resumen

source: _General comments:_ Make sure there is a (preferably single line) short description of the object. In most cases you'll need to ignore the "not use variable names or the function name" rule.
es: _Comentarios generales:_ Asegúrate de que haya una descripción corta (de preferencia una sola línea) del objeto. En la mayoría de casos tendrás que ignorar la regla de “no usar los nombres de las variables o de la función”.

source: _pymc.Uniform class docstring:_ {fas}`check`
es: _Cadena de documentación de la clase pymc.Uniform:_ {fas}`check`

source: Deprecation warning
es: Advertencia de depreciación

source: _General comments:_ There should be no deprecation warnings, we use a decorator for that. If you find a docstring with one, take a note, do not modify it and let us know when you open the PR.
es: _Comentarios generales:_ No debería haber advertencias de caducidad, usamos un decorador para eso. Si encuentras una cadena de documentación con una, toma nota, no lo modifiques y avísanos cuando abras el PR.

source: Extended summary
es: Resumen extendido

source: _General comments:_ This section is quite free and will probably need no modifications other than maybe directive updates or moving some code to the notes section.
es: _Comentarios generales:_ Esta sección ya lleva bastante avance y probablemente no necesite muchas modificaciones además de, tal vez, actualizar directivas o mover algo de código a la sección de notas.

source: _pymc.Uniform class docstring:_ Missing close figs in the plot directive.
es: _Cadena de documentación de la clase pymc.Uniform class docstring:_ Faltó cerrar figs en la directiva de gráficos.

source: Parameters
es: Parámetros

source: _General comments:_ This is the section that will most probably need more work. Points to add or emphasize in addition to the advise on numpydoc:
es: _Comentarios generales:_ Esta es la sección que, probablemente, tomará la mayor cantidad de trabajo. Algunos aspectos clave a tener en cuenta además de los mencionados en los consejos sobre numpydoc:

source: The colon between an argument name and it's type must be both **preceded and followed** by a space.
es: Los dos puntos entre un nombre de argumento y su tipo deben llevar espacios **antes y después**.

source: Type hints should go in the call signature, not in the docstring. `Optional[Union[str, int]]` is not adequate for a docstring, it should be `str or int, optional`. Type hints target machines, docstrings target humans.
es: Las pistas de tipado deberían ir en la firma de la función, no en la cadena de documentación. `Optional[Union[str, int]]` no es un contenido adecuado para una cadena de documentación, debería ser `str or int, optional`. Las pistas de tipado son para las computadoras, las cadenas de documentación son para las personas.

source: Optional parameters must be indicated with `, optional` or `, default <value>`. If the default value is of the documented type and used directly, using default instead of optional is preferred. However, if the default value depends on other parameters or is a placeholder (i.e. it is very common to use `None` for kwarg type arguments) then optional should be used, explaining the default in the description.
es: Los parámetros opcionales deben indicarse con `, optional` o `, default <value>`. Si el valor por defecto es del tipo documentado y se utiliza directamente, es preferible utilizar default en lugar de optional. Sin embargo, si el valor por defecto depende de otros parámetros o es un marcador de posición (por ejemplo, es muy común usar `None` para argumentos de tipo kwarg) entonces debe usarse optional, explicando el valor por defecto en la descripción.

source: In type descriptions. We have several aliases available to keep raw docstrings short and clear while generating still a nice html page with all the correct links:
es: En las descripciones de tipos. Tenemos varios alias disponibles para mantener las cadenas de documentación sin procesar cortos y claros mientras se genera una página html agradable con todos los enlaces correctos:

source: **`tensor_like`:** One of the most common (if not the most common) aliases. It should be used in all parameters that take an aesara tensor or any object that can be converted to it. In general, you'll have to change `tensor`, `aesara tensor` (including combinations with different capitalization, dot or hyphen in between) to `tensor_like`.
es: **`tensor_like`:** Uno de los alias más comunes (si no el más común). Debe usarse en todos los parámetros que tomen un tensor aesara o cualquier objeto que pueda convertirse en él. En general, tendrás que cambiar `tensor`, `aesara tensor` (incluyendo combinaciones con diferentes mayúsculas, punto o guion en medio) por `tensor_like`.

source: **`TensorVariable`:** Similar to `tensor_like` but should only be used for parameters that won't be converted internally and need to be Aesara tensors before passing them to the arguments. Use `TensorVariable`, without extra quotes or backticks. Ask if you are unsure about using `tensor_like` or `TensorVariable`.
es: **`TensorVariable`:** Similar a `tensor_like` pero solo debe usarse para parámetros que no serán convertidos internamente y necesitan ser tensores de Aesara antes de pasarlos a los argumentos. Utiliza `TensorVariable`, sin comillas extra o backticks. Pregunta si no estás seguro sobre el uso de `tensor_like` o `TensorVariable`.

source: **`RandomVariable`:** Change `var`, `random var`, `aesara var` and similar concepts should be `RandomVariable`
es: **`RandomVariable`:** Cambia `var`, `random var`, `aesara var` y conceptos similares, deberían ser `RandomVariable`.

source: **`array_like`:** Change `array like` or `array-like` to `array_like` with an underscore. If you encounter this in a returned parameter, note it in the PR description.
es: **`array_like`:** Cambia `array like` o `array-like` por `array_like` con guion bajo. Si encuentras esto en un parámetro devuelto, anótalo en la descripción del PR.

source: **`ndarray`:** Change `np.ndarray` or `numpy.ndarray` to `ndarray`. However, if you encounter this in an input argument, note it in the PR description.
es: **`ndarray`:** Cambia `np.ndarray` o `numpy.ndarray` por `ndarray`. Sin embargo, si encuentras esto en un argumento de entrada, anótalo en la descripción del PR.

source: **`Covariance`** and **`Mean`**: _within the gp module only_ `covariance`, `covariance objects`, `Covariance instances` and the like should be modified to this. Same for `Mean`
es: **`Covariance`** and **`Mean`**: _solo dentro del módulo gp_ `covariance`, `covariance objects`, `Covariance instances` y similares deben modificarse a `Covariance`. Lo mismo para `Mean`.

source: **`InferenceData`**: change things like `arviz.InferenceData` or `inference data` to this.
es: **`InferenceData`**: cambia cosas como `arviz.InferenceData` o `inference data` por esto.

source: **`MultiTrace`** and **`BaseTrace`**: change anything containing this in the type to them. The most probable thing to find is `pymc.backends.base.MultiTrace`
es: **`MultiTrace`** y **`BaseTrace`**: cambia cualquier cosa que contenga esto en el tipo a ellos. Lo más probable es encontrar `pymc.backends.base.MultiTrace`.

source: **`Point`**: change `pymc.Point`, `point` and similars to this
es: **`Point`**: cambia `pymc.Point`, `point` y parecidos por esto

source: **`SMC_kernel`**: _within the smc module_ change references to kernel, smc kernel and the like to this. Note the underscore and capitalization!
es: **`SMC_kernel`**: _dentro del módulo smc_ cambia las referencias a kernel, smc kernel y similares por esto. Fíjate en el guion bajo y las mayúsculas.

source: **`Aesara_Op`**: change `Aesara Op`, `Op` and variations to `Aesara_Op`, note the underscore and capitalization!
es: **`Aesara_Op`**: cambia `Aesara Op`, `Op` y variaciones por `Aesara_Op`, ¡ten cuidado con el guión bajo y las mayúsculas!

source: We might also realize we are missing an important alias thanks to your contributions. Check the [conf.py](https://github.com/pymc-devs/pymc/blob/main/docs/source/conf.py) file from time to time to see if there are new aliases not explained here. Aliases are defined in the `numpydoc_xref_aliases` dict.
es: También podríamos darnos cuenta de que nos falta un alias importante gracias a tus contribuciones. Revisa el archivo [conf.py](https://github.com/pymc-devs/pymc/blob/main/docs/source/conf.py) de vez en cuando para ver si hay nuevos alias no explicados aquí. Los alias se definen en el diccionario `numpydoc_xref_aliases`.

source: _pymc.Uniform class docstring:_
es: _Cadena de documentación de la clase pymc.Uniform:_

source: There is no space between argument name and colon
es: No debe haber espacios entre el nombre de un argumento y los dos puntos.

source: Both arguments are actually optional. In Distributions, this can't be seen in the class itself but in the `dist` method. In the Uniform case, it is `dist(cls, lower=0, upper=1, **kwargs)`. Therefore they are both optional with defaults to 0 and 1 respectively.
es: Ambos argumentos son, de hecho, opcionales. En Distributions, esto no se puede ver en la clase como tal sino en el método `dist`. En el caso de Uniform, tendremos `dist(cls, lower=0, upper=1, **kwargs)`. Por tanto, los dos son opcionales y tienen valores por defecto de 0 y 1, respectivamente.

source: Input parameters to distributions can be Aesara tensors, scalars or NumPy arrays. Therefore, `tensor_like` should be used. In this case, the parameters of the distribution are real numbers (as opposed to discrete for example) so we will use `tensor_like of float`. For discrete parameters we would use `tensor_like of int`.
es: Los parámetros de entrada a las distribuciones pueden ser tensores Aesara, escalares o arreglos NumPy. Por lo tanto, se debe utilizar `tensor_like`. En este caso, los parámetros de la distribución son números reales (en lugar de discretos, por ejemplo) por lo que utilizaremos `tensor_like of float`. Para parámetros discretos usaríamos `tensor_like of int`.

source: Returns and yields
es: Retorna y produce

source: _General comments:_ Nothing to add to numpydoc. They follow the style of the parameters section but with the argument name being optional for single outputs. You should look for the same things detailed in parameters section plus making sure that the type (plus name if any) and the description are on different lines.
es: _Comentarios generales:_ Nada que añadir a numpydoc. Siguen el estilo de la sección de parámetros pero con el nombre del argumento siendo opcional para valores retornados o producidos únicos. Deberías buscar las mismas cosas detalladas en la sección de parámetros además de asegurarte de que el tipo (más el nombre si lo hay) y la descripción están en líneas diferentes.

source: Commit the changes to git and get your PR ready
es: Confirma tus cambios en git y prepara tu PR.

source: Great! You are ready to do your PR now.
es: ¡Fantástico! Ya estás listo para hacer tu PR.

source: You can follow the {ref}`PR Tutorial <pr_tutorial>` which explains how you can do a PR to PyMC.
es: Puedes seguir el {ref}`PR Tutorial <pr_tutorial>` que explica cómo puedes hacer un PR a PyMC.

source: Your PR will be reviewed and hopefully merged by the PyMC team. After that, you can properly celebrate your first contribution to PyMC! Thanks for contributing!
es: Tu PR será revisado y, con suerte, fusionado por el equipo de PyMC. Después de eso, podrás celebrar tu primera contribución a PyMC. ¡Gracias por contribuir!
