Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/about/intro_to_array_operations/index.po
Languages: es

source: Webinar notebook
es: Cuaderno del webinar

source: Introduction to Array Operations in Python
es: Introducción a las operaciones con arreglos en Python

source: This is a ~40 minute session to introduce you to array manipulation and basics of Python, which will be useful to contribute to computational open source libraries in Python. We have some specific aims in mind:
es: Esta es una sesión de ~40 minutos para introducirte a la manipulación de arreglos y a los aspectos básicos de Python, lo que será útil para contribuir a librerías computacionales de código abierto en Python. Tenemos algunas metas específicas en mente:

source: Understanding basics of arrays, lists and datatypes in Python
es: Entender los aspectos básicos de los arreglos, listas y tipos de datos en Python

source: Using Python with Numpy
es: Usar Python con Numpy

source: Motivating you to contribute to PyMC, and hopefully also to other open source libraries
es: Motivarte a contribuir a PyMC, y esperamos que también a otras librerías de código abierto

source: This event is a part of a larger series of PyMC - Data Umbrella events, which are aimed at helping you contribute to PyMC (Open source library for Probabilistic Programming in Python)
es: Este evento es parte de una serie más amplía de eventos de PyMC - Data Umbrella, cuyo objetivo es ayudarte a contribuir a PyMC (una librería de código abierto para programación probabilística en Python)

source: Details
es: Detalles

source: Audience: people who don't know Python but have some basic programming knowlege
es: Audiencia: personas que no conocen Python pero que tienen conocimientos básicos en programación

source: [Github Repo](https://github.com/pymc-devs/pymc-data-umbrella)
es: [Repositorio de Github](https://github.com/pymc-devs/pymc-data-umbrella)

source: All the content is available on this website, and you can run the code from the website to follow along with the webinar.
es: Todo el contenido está disponible en este sitio web, y puedes ejecutar el código desde el sitio web mientras miras el webinar.

source: Go to the webinar notebook!
es: ¡Ve al notebook del webinar!

source: Speaker
es: Ponente

source: [Meenal Jhajharia](https://mjhajharia.com) is a computer science and mathematics undergraduate in junior year. She has been working on Bayesian time series estimation models with PyMC, this project started when she was a Google Summer of Code’21 student . Generally she is interested in Probabilistic Programming, NLP, and algorithms.
es: [Meenal Jhajharia](https://mjhajharia.com) es una estudiante de tercer año de pregrado en ciencias de la computación y matemáticas. Ha estado trabajando en modelos de estimación de series de tiempo con PyMC desde que participó como estudiante en el Google Summer of Code de 2021. En general, le interesan la programación probabilística, el procesamiento de lenguaje natural y los algoritmos.

source: Video
es: Vídeo
