Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/about/intro_to_array_operations/notebook.po
Languages: es

source: Introduction to Array Operations in Python
es: Introducción a las operaciones con arreglos en Python

source: **Meenal Jhajharia. she/her.**
es: **Meenal Jhajharia (ella)**

source: CS and Math undergrad, University of Delhi
es: Estudiante de pregrado en ciencias de la computación y matemáticas, Universidad de Delhi

source: PyMC core contributor | GSoC student
es: Contribuidora principal en PyMC | estudiante de GSoC

source: Contact: [meenal@mjhajharia.com](mailto:meenal@mjhajharia.com) | [mjhajharia.com](https://mjhajharia.com)
es: Contacto: [meenal@mjhajharia.com](mailto:meenal@mjhajharia.com) | [mjhajharia.com](https://mjhajharia.com)

source: This banner is generated from [this code](https://raw.githubusercontent.com/pymc-devs/pymc-data-umbrella/main/banner.py), the code in this link is a trivial customization of the [original code](https://github.com/pymc-devs/pymcon/blob/gh-pages/assets/make_trajectories.py) by [Colin Caroll](https://colindcarroll.com/) who designed a [similar banner for pymcon’20](https://pymcon.com/), Colin is amazing at visualization stuff and even has a couple of talks about it!!
es: Este encabezado se generó a partir de [este código](https://raw.githubusercontent.com/pymc-devs/pymc-data-umbrella/main/banner.py), el cual es una modificación trivial del [código original](https://github.com/pymc-devs/pymcon/blob/gh-pages/assets/make_trajectories.py) escrito por [Colin Caroll](https://colindcarroll.com/), quien diseñó [uno similar para pymcon’20](https://pymcon.com/). ¡¡Colin es increíble haciendo visualizaciones e incluso tiene algunas charlas al respecto!!

source: Overview
es: Resumen

source: Introduction
es: Introducción

source: Python Objects
es: Objetos de Python

source: List Comprehension
es: Comprensiones de listas

source: Basics of NumPy
es: Aspectos básicos de NumPy

source: Why Python?
es: ¿Por qué Python?

source: Useful for quick prototyping
es: Es útil para el prototipado rápido

source: Dynamically Typed, Interpreted, High level data types
es: Tipado dinámico, interpretado, tipos de datos de alto nivel

source: Large number of scientific open source software
es: Gran cantidad de software científico de código abierto

source: Best Place to learn more : [Official Python Tutorial](https://docs.python.org/3/tutorial/index.html)
es: El mejor lugar para aprender más: [tutorial oficial de Python](https://docs.python.org/3/tutorial/index.html)

source: Let's get started!
es: ¡Empecemos!

source: All the code that is shown in this webinar can be executed from its website. Therefore you have two ways to follow along:
es: Todo el código que se muestra en este webinar puede ser ejecutado desde el sitio web. Esto significa que tienes dos maneras de seguir el tutorial:

source: Click on the run code button and execute the code straight from this page
es: Haz clic sobre el botón "run code" y ejecuta el código directamente desde esta página

source: Clone the GitHub repo: [pymc-devs/pymc-data-umbrella](https://github.com/pymc-devs/pymc-data-umbrella) and follow along locally using Jupyter
es: Clona el repositorio de GitHub: [pymc-devs/pymc-data-umbrella](https://github.com/pymc-devs/pymc-data-umbrella) y sigue el tutorial de forma local usando Jupyter

source: Python Data Types
es: Tipos de datos de Python

source: ![data types](data_types.png)
es: ![tipos de datos](data_types.png)

source: data types
es: tipos de datos

source: Numbers
es: Números

source: Certain numeric modules ship with Python
es: Algunos módulos numéricos vienen con Python

source: Strings
es: Cadenas

source: Sequence Operations
es: Operaciones sobre secuencias

source: Immutability
es: Inmutabilidad

source: Immutable objects cannot be changed
es: Los objetos inmutables no se pueden cambiar

source: Polymorphism
es: Polimorfismo

source: Operators or functions mean different things for different objects
es: Los operadores o funciones significan cosas diferentes para objetos distintos

source: Length or size means different things for different datatypes
es: La longitud o el tamaño significan cosas distintas para tipos de datos diferentes

source: Related: Class Polymorphism, Method Overriding and Inheritance
es: Relacionado: polimorfismo de clase, sobre-escritura de métodos y herencia

source: Lists
es: Listas

source: Positionally ordered collections of arbitrarily typed objects (mutable, no fixed size)
es: Colecciones ordenadas posicionalmente de objetos con tipos arbitrarios (mutables, sin tamaño fijo)

source: List-specific operations
es: Operaciones específicas para listas

source: More: sort(), reverse()
es: Más: sort(), reverse()

source: List indexing and slicing
es: Indexado y particionamiento de listas

source: Nested List Comprehension
es: Comprensiones anidadas de listas

source: Lambda Function
es: Funciones lambda

source: NumPy’s array class -> ndarray(array)
es: La clase arreglo de NumPy -> ndarray(array)

source: Simple array operation
es: Operación simple con un arreglo

source: General Properties of ndarrays
es: Propiedades generales de los ndarrays

source: Ways to create new arrays
es: Formas de crear nuevos arreglos

source: Generate values in a certain range
es: Generar valores en un rango determinado

source: Random Number Generator
es: Generador de números aleatorios

source: Cumulative sum against specified axis (in this case only one axis is present)
es: Suma acumulada a lo largo de un eje específico (en este caso solo hay un eje)

source: Multi-dimensional arrays
es: Arreglos de varias dimensiones

source: Element-wise printing
es: Imprimir elemento por elemento

source: Transpose
es: Transpuesta

source: Reshape
es: Cambiar de forma

source: Stacking
es: Apilado

source: Used to deal with inputs that do not have exactly the same shape
es: Se usa para manejar entradas que no tienen exactamente la misma forma

source: If all input arrays do not have the same number of dimensions, a “1” will be repeatedly prepended to the shapes of the smaller arrays until all the arrays have the same number of dimensions.
es: Si no todos los arreglos de entrada tienen el mismo número de dimensiones, un "1" se le añadirá de manera repetida a las formas de los arreglos más pequeños hasta que tengan el mismo número de dimensiones.

source: Arrays with a size of 1 along a particular dimension act as if they had the size of the array with the largest shape along that dimension. The value of the array element is assumed to be the same along that dimension for the “broadcast” array.
es: Los arreglos con un tamaño de 1 en una dimensión en particular funcionan como si tuvieran el tamaño de un arreglo con la forma mas grande en esa dimensión. El valor del elemento del arreglo se toma como el valor que tendrán todas las posiciones en esa dimensión del arreglo de "broadcast".

source: Arrays with same dimensions
es: Arreglos con la misma dimensionalidad

source: 1-d Array and a Scalar
es: Arreglo 1-d y un escalar

source: Intuitively: scalar b being "stretched" to same shape as a
es: De manera intuitiva, estamos "estirando" el escalar b para que tenga la misma forma que a

source: Reality: broadcasting moves less memory around (computationally efficient)
es: En realidad, el broadcasting mueve menos memoria, por lo que es más eficiente computacionalmente

source: Arrays where dimensions aren’t exactly same, but are aligned along the leading dimension
es: Arreglos cuyas dimensiones no son exactamente las mismas, pero que están alineados en la dimensión más a la derecha

source: Arrays where dimensions aren’t exactly same, but leading dimension is 1, so it works
es: Arreglos cuyas dimensiones no son exactamente las mismas, pero donde la dimensión que está más a la derecha es 1 así que sí funciona

source: Broadcasting fails!
es: ¡El broadcasting falla!

source: NumPy compares shapes element-wise for two given arrays
es: NumPy compara formas elemento por elemento para dos arreglos dados

source: It starts with the trailing (i.e. rightmost) dimensions Two dimensions are compatible when
es: Empieza con las dimensiones que están más a la derecha. Dos dimensiones son compatibles cuando

source: they are equal, or
es: son iguales, o

source: one of them is 1
es: una de ellas es 1

source: Arrays do not need to have the same exact number of dimensions to be compatible. Broadcasting is a convenient way of taking the outer product (or any outer operation)
es: Los arreglos no tienen que tener la misma cantidad de dimensiones para ser compatibles. El broadcasting es una manera conveniente de obtener el producto exterior (o cualquier otra operación exterior)

source: Here broadcasting fails because of the mismatch of leading dimensions
es: Aquí el broadcasting falla porque las dimensiones de más a la derecha no son las mismas.

source: We transpose a to reshape it along a new axix
es: Transponemos a para cambiarlo de forma en un eje nuevo

source: Now it works!
es: ¡Ahora funciona!

source: Indexing
es: Indexado

source: Next thing to look at -> https://numpy.org/doc/stable/user/basics.html
es: Lo próximo que debes ver -> https://numpy.org/doc/stable/user/basics.html

source: Note / Reference: A lot of the things here are modified/original versions of examples given in official Python or NumPy documentation, so that’s the best source to learn comprehensively, this is meant to be an accessible introduction!!
es: Nota / referencia: muchas de las cosas que vimos son versiones modificadas/originales de ejemplos que están en la documentación oficial de Python o de NumPy, así que esa es la mejor fuente para aprender de forma exhaustiva. ¡Esto es una introducción accesible!
