Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/sprint/faq.po
Languages: es

source: Frequently Asked Questions
es: Preguntas más comunes

source: Do I need to be a PyMC user to participate in the open source working session?
es: ¿Necesito ser un usuario de PyMC para participara en la sesión de trabajo de código abierto?

source: **Response:** It is not necessary to be a PyMC user to contribute to this open source project. There are a number of issues where we could use your contribution. Examples:
es: **Respuesta:** No es necesario ser usuario de PyMC para contribuir a este proyecto de código abierto. Hay una serie de temas en las que su contribución sería de gran ayuda. Ejemplos:

source: Adding timestamps to videos from our PyMCon conference
es: Agregar timestamps a videos de nuestra conferencia PyMCon

source: Updating docstrings in documentation. We have a webinar: {ref}`example_pr`; with explanation, background and examples on how to do it.
es: Actualizando docstrings en la documentación. Tenemos un seminario web: {ref}`example_pr`; con explicación detallada, contexto y ejemplos de como hacerlo.

source: Updating the style and formatting of {doc}`example notebooks <nb:gallery>`. We have a webinar: {ref}`contributing_docs`; with explanation, background and examples on how to do it.
es: Actualizando el estilo y formato de {doc}`example notebooks <nb:gallery>`. Tenemos un seminario web {ref}`contributing_docs`; con explicación detallada, contexto y ejemplos de como hacerlo..

source: Are we required to attend all the sessions in order to sign up?
es: ¿Es requisito atender todas las sesiones para registrarse?

source: **Response:** It is *not required* to attend all the sessions. Ideally, it is beneficial if folks can attend as many sessions as they can, to build up their open source skills and familiarity with the PyMC project. Some sessions may be more convenient for your time zone.
es: **Respuesta:** *No es obligatorio* asistir a todas las sesiones. Idealmente, es beneficioso si los participantes puede asistir a tantas sesiones como sea posible y así desarrollar sus habilidades de código abierto y familiarizarse con el proyecto PyMC. Algunas sesiones pueden ser más convenientes para su zona horaria.

source: Is there a requirement to have attended #1 of the working session?
es: ¿Es requisito haber asistido a la #1 de la sesión de trabajo?

source: **Response:** The Pre-event office hours are an opportunity for incoming contributors to ask questions for the upcoming working sessions. It is *not required* to attend a specific session as a prerequisite for other sessions. Ideally, it is beneficial if folks can attend as many sessions as they can, to build up their open source skills and familiarity with the PyMC project.
es: **Respuesta:** El horario de tutoría previo al evento es una oportunidad para que los colaboradores entrantes hagan preguntas para las próximas sesiones de trabajo. *No es obligatorio* asistir a una sesión específica como requisito previo para otras sesiones. Idealmente, es beneficioso si la gente puede asistir a tantas sesiones como sea posible, para desarrollar sus habilidades de código abierto y familiarizarse con el proyecto PyMC.

source: If you are unable to attend the Pre-event office hours, you can ask your questions in one of these ways:
es: Si no puede asistir al horario de tutoría previo al evento, puede hacer sus preguntas en los siguientes medios:

source: On [PyMC Discourse](https://discourse.pymc.io/new-topic?category=Questions/v4&tags=open-source-working-sessions)
es: En el [Discourse de PyMC](https://discourse.pymc.io/new-topic?category=Questions/v4&tags=open-source-working-sessions)

source: Email us at: [info@dataumbrella.org](mailto:info@dataumbrella.org)
es: Envíanos un correo a: [info@dataumbrella.org](mailto:info@dataumbrella.org)
