Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/sprint/index.po
Languages: es

source: Event info
es: Información del evento

source: **Wondering if the sessions are for you?** We have got just {ref}`the page <decision_tree>`
es: **¿Preguntándote si puedes participar en las sesiones?** Tenemos está {ref}`página <decision_tree>` para ti.

source: **Ready to contribute?** Go to {ref}`docstring_tutorial` page
es: **¿Listo para contribuir?** Va a la página {ref}`docstring_tutorial`

source: Open Source Working Sessions
es: Sesiones de trabajo de código abierto

source: Data Umbrella is organizing a series of open source working sessions to contribute to the PyMC project. For more information, see {ref}`Resources <resources>` section.
es: Data Umbrella está organizando una serie de sesiones de trabajo de código abierto para contribuir al proyecto de PyMC. Para mayor información, ve a la sección {ref}`Resources `.

source: Goals
es: Objetivos

source: In these sessions we’re focusing on bringing in new contributors, we sincerely hope this will be a welcoming, inclusive experience for you into the world of open source software. We hope to help you to the best of our abilities and learn from you as well! The session will consist of small resolvable issues and contributing to the PyMC documentation, so if you aren’t experienced in software development no worries at all, you can contribute to documentation with knowledge of markdown or statistics.
es: En estas sesiones, nos estamos enfocando en traer nuevos colaboradores, esperamos sinceramente que esta sea una experiencia acogedora e inclusiva para ti en el mundo del software de código abierto. ¡Esperamos ayudarte de la mejor forma posible y aprender también de ti! La sesión consistirá en trabajar en problemas menores y en la documentación de PyMC, por lo que si no tienes experiencia en el desarrollo de software, no te preocupes en absoluto, puedes contribuir a la documentación con conocimientos de Markdown o Estadística.

source: Requirements
es: Requerimientos

source: Requirements depend on the contribution you are aiming for, the only common requirements are internet access and a laptop!
es: Los requerimientos dependen de la contribución que deseas haces, los únicos requisitos comunes son acceso a Internet y un computador portátil.

source: Timestamps/transcripts
es: Marcas de tiempo/transcripciones

source: GitHub account
es: Cuenta en GitHub

source: Basic git
es: Git básico

source: Code and Documentation
es: Código y documentación

source: Note: a small subset of documentation contributions only requires a subset of these requirements, see below if interested.
es: Nota: un subconjunto de contribuciones de documentación solo requiere algunos de estos requisitos, mira los detalles a continuación si estás interesado.

source: Python/conda environment setup
es: Configuración del entorno con Python/conda

source: Basic working knowledge of terminal and git
es: Conocimiento básico del terminal de comandos y git

source: Documentation contributions (non-code dependent)
es: Contribuciones a la documentación (independientes del código)

source: That would be for example working on the glossary or adding references to docstrings.
es: Eso sería, por ejemplo, trabajar en el glosario o agregar referencias a los docstrings.

source: Raw text editor
es: Editor de texto sin formato

source: Translations
es: Traducciones

source: [Transifex](https://www.transifex.com) account
es: Cuenta en [Transifex](https://www.transifex.com)

source: English + (Spanish or Portuguese)
es: Ingles + (Español o Portugués)

source: GitHub account (optional, for account authentication)
es: Cuenta de GitHub (opcional, para autenticarse en la cuenta)

source: Other than these types of contributions, you can make different kinds of contributions with different skill sets, for example:
es: Además de estos tipos de contribuciones, puedes realizar diferentes tipos de contribuciones con otros tipos de habilidades, por ejemplo:

source: You can contribute to documentation with knowledge of markdown and maybe some basic statistics
es: Puedes contribuir a la documentación con conocimientos de Markdown y opcionalmente estadísticas básicas.

source: You can contribute to CI/CD issues or Python issues with basic knowledge of programming
es: Puedes contribuir a problemas con CI/CD o problemas de Python con conocimientos básicos de programación

source: You can contribute to core codebase with knowledge of Python + Bayesian Statistics
es: Puedes contribuir a la base de código con conocimiento de Python + Estadística Bayesiana

source: Note: {ref}`Check the event cheat sheet <decision_tree>` to know a suitable area of contribution and some resources to prepare you for it
es: Nota: {ref}`Revisa la ficha de ayuda <decision_tree>` para saber de las áreas en las que mejor podrías contribuir y algunos recursos útiles para prepararte.

source: Target Audience
es: Audiencia Objetiva

source: The following table answers the question **"This sprint is for someone who is/has ..."**
es: La siguiente tabla responde a la pregunta **"Este evento es para alguien que es/tiene..."**

source: Yes
es: Si

source: New to Open source
es: Nuevo a código abierto

source: Statistical background
es: Conocimientos en Estadística

source: Currently working in data science/software
es: Trabajando actualmente en ciencia de datos/software

source: Knows/uses PyMC
es: Conoce/usa PyMC

source: Member of the PyMC team
es: Miembro del equipo de PyMC

source: Read the {ref}`decision_tree` for more detailed answers and to see what types of contributions can you make depending on your interests and background.
es: Lee el {ref}`decision_tree` para obtener información más detalladas y ver qué tipo de contribuciones puedes hacer según sus intereses y experiencia.
