Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/sprint/prep-work.po
Languages: es

source: Event preparation
es: Preparación del evento

source: Checklist
es: Lista de verificación

source: Task
es: Tarea

source: Status
es: Estado

source: Notes
es: Notas

source: Do I have a GitHub account?
es: ¿Tengo una cuenta de GitHub?

source: Did I Install Git?
es: ¿Instalé Git?

source: Did I Install Conda?
es: ¿Instalé Conda?

source: Do I have a Text Editor?
es: ¿Tengo un editor de texto?

source: Did I fork the PyMC repo?
es: ¿Hice una bifurcación (fork) del repositorio de PyMC?

source: If you need help with any of the previous steps, you will find clear instructions in the {ref}`Environment Setup <environment_setup>` section.
es: Si necesitas ayuda con alguno de los pasos anteriores, puedes encontrar instrucciones detalladas en la sección {ref}`Configuración del entorno <environment_setup>`.

source: Session day
es: Día de la sesión

source: To communicate during the session, we will be using Discord. The [Using the Discord Server](https://youtu.be/w2A8SknM-68) introduction video contains a brief introduction to the Discord Data Umbrella server with some tips on how to navigate the application.
es: Para comunicarnos durante la sesión, usaremos Discord. El video [Uso del servidor Discord](https://youtu.be/w2A8SknM-68) contiene una breve introducción al servidor Discord de Data Umbrella con algunos consejos sobre cómo navegar por la aplicación.

source: Pair programming
es: Programación en pareja

source: Live Share is an extension from Visual Studio Code that allows you to collaboratively edit and debug with others in real-time. It allows you to instantly share your current project, edit snippets of code at the same time or follow someone’s cursor while they program. The following video (18 minutes) shows how to use this extension:
es: Live Share es una extensión de Visual Studio Code que permite editar y depurar en colaboración con otros en tiempo real. Te permite compartir instantáneamente tu proyecto actual, editar fragmentos de código al mismo tiempo o seguir el cursor de alguien mientras programa. El siguiente video (18 minutos) muestra cómo usar esta extensión:
