Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/sprint/sprint-guide.po
Languages: es

source: Event Guide
es: Guía del evento

source: Here are some guidelines and suggestions about the event for participants and volunteers!
es: Aquí encontraras algunos lineamientos y sugerencias sobre el evento para participantes y voluntarios.

source: General Information
es: Información general

source: Be Polite
es: Sé amable

source: Ask questions
es: Haz preguntas

source: Don't use any discriminatory terms
es: No uses términos que puedan ser discriminatorios

source: Use gender neutral pronouns unless you know someone's preferred pronouns
es: Use pronombres neutrales de género a menos que sepa los pronombres preferidos de alguien

source: Don't use words like "guys", instead say "folks" or "people"
es: Usa términos incluyentes

source: Be inclusive and kind
es: Sé inclusivo y amable

source: The sign up instructions are available on Meetup, please try to join on the starting time so you can receive proper help and guidance for the session.
es: Las instrucciones para registrarte están disponibles en Meetup, intenta unirse a la hora de inicio para que puedas recibir la ayuda y orientación adecuadas para la sesión.

source: We will have separate channels (or "rooms"):
es: Tendremos canales separadas ("channels" o "rooms")

source: Women and Non binary folks: this breakout room is specifically for women and non binary folks, we hope you have a meaningful space here where you're heard!
es: Mujeres y personas no binarias: esta sala de trabajo es específicamente para mujeres y personas no binarias, ¡esperamos que tenga un espacio significativo aquí donde te escuchen!

source: New to open source: this breakout room is for newcomers to open source so you can get suitable help
es: Nuevo en código abierto: esta sala de trabajo es para los recién llegados al código abierto para que pueda obtener la ayuda adecuada

source: Code related PR: If you are making a code related contribution then you'll be assigned to this breakout room
es: Contribuciones de Código: si está haciendo una contribución relacionada con código, se le asignará a esta sala de trabajo

source: Documentation related PR: If you are making a Documentation related contribution then you'll be assigned to this breakout room
es: Contribuciones de Documentación: si está haciendo una contribución relacionada con documentación, se le asignará a esta sala de trabajo

source: Spanish Speaker: Please let us know if you prefer this. We will ensure we have a Spanish-speaking mentor available.
es: Sala de Español: Háganos saber si prefiere esto. Nos aseguraremos de tener un mentor que hable español disponible.

source: These breakout channels/rooms aren't rigid, you can choose which one you wish to be in, they're created solely to help us help you!
es: Estos canales/salas de grupo no son rígidos, puedes elegir en cuál deseas estar, ¡se crearon únicamente para ayudarnos a ayudarte!

source: Volunteer Guide
es: Guía para los voluntarios

source: Be patient and kind to session participants, if you feel unable to help someone with a doubt or issue, redirect it to another volunteer or PyMC team member if someone is available. If that does not work, consider suggesting a new issue to the participant.
es: Sé paciente y amable con los participantes de la sesión, si te sientes incapaz de ayudar a alguien con una duda o problema, dirigelo a otro voluntario o miembro del equipo PyMC si hay alguien disponible. Si eso no funciona, considera sugerir un nuevo problema al participante.

source: Encourage people to introduce themselves and ask questions.
es: Anima a las personas a presentarse y a hacer preguntas.

source: Do flag any (really ANY) inappropriate behaviour. Warn the participant or remove them from the platform in these cases:
es: Señala cualquier (realmente CUALQUIER) comportamiento inapropiado. Avisa al participante o sácalo de la plataforma en estos casos

source: They make a discriminatory remark
es: Si hacen un comentario discriminatorio

source: They are being persistently rude
es: Si son persistentemente groseros

source: They are a spammer
es: Si son un spammer

source: Tentative Structure of the Session
es: Estructura tentativa de la sesión

source: All participants join, the first 10-15 mins are spent with everyone introducing and saying hi
es: Todos los participantes se unen, los primeros 10-15 minutos se dedican a que todos se presenten y saluden.

source: Participants are redirected to the board consisting of available issues that they can choose [from here](https://github.com/pymc-devs/pymc/projects/4)
es: Los participantes son redirigidos al [tablero] (https://github.com/pymc-devs/pymc/projects/4) [from here](https://github.com/pymc-devs/pymc/projects/4) con los problemas disponibles para poder elegir

source: If a participant doesn't find a suitable issue here they're encouraged to ask the volunteers for help, who will suggest an issue or task based on their said skills
es: Si un participante no encuentra un problema adecuado aquí, se le anima a pedir ayuda a los voluntarios, quienes sugerirán un problema o tarea en función de sus habilidades.

source: Participants go to breakout rooms and work on their issues, they should make a comment on the issue they're interested in, after which volunteers will update that issue on the Event Dashboard for clarity
es: Los participantes se unen a las salas de trabajo y trabajan en sus problemas (issues), deben hacer un comentario en el problema en el que deseen trabajar, después de lo cual los voluntarios actualizarán el estado del problema para mayor claridad.

source: Volunteers keep alternating between breakout rooms to checkup on Participants, to see if they need help
es: Los voluntarios van alternando entre las salas para dar acompañamiento a los participantes y ver si necesitan ayuda.

source: Participants can go to the "help-desk" channel/room if they have a question
es: Los participantes pueden dirigirse al canal/sala del "help-desk" si tienen alguna pregunta

source: Cheers, have fun folks!
es: Saludos, que se diviertan!

source: [Event Organizers](https://github.com/pymc-devs/pymc/projects/4)
es: [Organizadores del evento](https://github.com/pymc-devs/pymc/projects/4)
