Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/sprint/sprint-cheatsheet.po
Languages: es

source: Your event cheat sheet
es: Tu ficha de ayuda para el evento

source: Welcome to this PyMC & Data Umbrella Open Source Working Session to help you get started contributing to PyMC.
es: Te damos la bienvenida a esta sesión de trabajo de código abierto de PyMC & Data Umbrella para ayudarte a empezar a contribuir a PyMC.

source: PyMC is already a mature package with multiple dedicated teams within its core contributor base. PyMC welcomes many types of contributions and we wanted to host an event where this "functional" diversity was one of the pillars.
es: PyMC es ya un paquete maduro con varios equipos dedicados dentro de su base de contribuidores principales. PyMC recibe con brazos abiertos muchos tipos de contribuciones y queríamos organizar un evento en el cuál esta diversidad "funcional" fuese uno de los pilares.

source: We also wanted to allow people from many different backgrounds to be able to participate in the event, so we eventually decided not to do a session. Instead, **we hosted a whole series of webinars and multiple Open Source Working Sessions**!
es: También queríamos permitirle a personas con muchas formaciones diferentes participar en el evento, así que decidimos no hacer una sesión. En vez de eso, ¡**organizamos una serie entera de webinars y varias sesiones de trabajo de código abierto**!

source: This is very ambitious (though hopefully not too much) and can be confusing so we have written this document to help you navigate this series, and attend the content that will help you reach your goal.
es: Esto es muy ambicioso (aunque esperamos que no tanto) y puede ser confuso, así que escribimos este documento para ayudarte a navegar esta serie y ver el contenido que te ayudará a alcanzar tu meta.

source: This page is structured as a decision tree. We have written questions and provide advise based on your answers.
es: Esta página está estructurada como un arbol de decisión. Tenemos preguntas escritas y te damos consejos con base en tus respuestas.

source: Already comfortable with Bayesian statistics but not interested in Python nor PyMC?
es: ¿Ya tienes familiaridad con la estadística Bayesiana pero no te interesan Python ni PyMC?

source: Jump straight to the {ref}`last webinar about contributing to documentation <contributing_docs>`. We have extensive statistical documentation to which you can contribute to! For example examples with detailed explanation along the code, a glossary of statistical terms, or descriptions of distributions and their parametrizations.
es: Puedes empezar directamente con el {ref}`último webinar acerca de contribuir a la documentación <contributing_docs>`. Tenemos una documentación estadística extensa a la que puedes contribuir. Por ejemplo, hay ejemplos con explicaciones detalladas acompañando el código, un glosario de términos estadísticos, o descripciones de las distribuciones y sus parametrizaciones.

source: The bulk of our documentation is written in markdown and Jupyter notebooks, so most of the skills you'll use: git/github, stats, technical writing and markdown transfer to any other stats related open source project {bdg-ref-warning-line}`I understand, jump <stats_join>`
es: La mayoría de nuestra documentación está escrita en markdown y en cuadernos de Jupyter, así que la mayoría de las habilidades que necesitarás (git/github, estadística, escritura técnica y markdown) son transferibles a cualquier otro proyecto de código abierto relacionado con estadística. {bdg-ref-warning-line}`Lo entiendo, omitir<stats_join>`

source: Do you know what Bayesian statistics is? What about {abbr}`PPLs (Probabilistic Programming Languages)`? And PyMC?
es: ¿Sabes qué es la estadística Bayesiana? ¿Y los {abbr}`PPLs (lenguajes de programación probabilística)`? ¿Y PyMC?

source: If you know _about_ this (no need to be an expert) move to the next question, otherwise we recommend you open the dropdown and watch the embedded video.
es: Si sabes _acerca_ de esto (no hace falta demasiada experiencia) pasa a la siguiente pregunta, de lo contrario te recomendamos abrir el desplegable y mirar el vídeo embebido.

source: About Bayesian statistics and PyMC
es: Sobre la estadística Bayesiana y PyMC

source: This talk by PyMC core contributor Oriol Abril Pla covers the basics of the Bayesian paradigm, probabilistic programming and PyMC.
es: Esta charla de uno de los contribuidores principales de PyMC, Oriol Abril Pla, cubre los aspectos básicos del paradigma Bayesiano, la programación probabilística y PyMC.

source: It is divided in two parts. The first half is explanatory of the concepts above. The second half goes over some PyMC examples from the community which you can skip. They use version 3 of PyMC but the event is focused on PyMC version 4. One of the webinars of the series is about using PyMC which goes in much more detail.
es: Se divide en dos partes. La primera mitad explica los conceptos descritos arriba. La segunda mitad muestra algunos ejemplos de PyMC hechos por la comunidad, los cuales puedes saltarte. Estos usan la versión 3 de PyMC pero el evento está centrado en la versión 4. Uno de los webinars de la serie es sobre usar PyMC y profundiza mucho más en el asunto.

source: Are you comfortable working with Python and NumPy arrays?
es: ¿Te va bien trabajando con Python y los arreglos de NumPy?

source: In case you aren't yet, we recommend the first webinar of the series: {ref}`array_ops`.
es: Si no, te recomendamos el primer webinar de la serie: {ref}`array_ops`.

source: Are you familiar with PyMC?
es: ¿Tienes familiaridad con PyMC?

source: In case you aren't yet, we recommend the second webinar of the series: {ref}`probprog_pymc`.
es: En caso de que no, te recomendamos el segundo webinar de la serie: {ref}`probprog_pymc`.
