Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/about/contributing_to_documentation/docs_presentation.po
Languages: es

source: There are still more directives, most of which you don't need to contribute to pymc examples. In the next section we'll go over our "jupyter style guide" and cover 3 more directives that are important for pymc-examples.
es: Hay incluso más directivas, la mayoría de las cuales no necesitas para contribuir a los ejemplos de PyMC. En la siguiente sección vamos a ver nuestra "guía de estilo de Jupyter" y cubriremos 3 directivas más que serán importantes para contribuir a los ejemplos de PyMC.

source: Our conventions
es: Nuestras convenciones

source: To try and ensure some common style and formatting among all the examples even though it is a collaborative effort with many people contributing, we also have some extra conventions. They are outlined in our documentation, at the {ref}`pymc:jupyter_style` page.
es: Tenemos algunas convenciones adicionales para intentar asegurar que haya un estilo y formato comunes en todos los ejemplos aunque se trate de un esfuerzo colaborativo de muchas personas. Estas están detalladas en nuestra documentación, en la página {ref}`pymc:jupyter_style`.
