Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/about/contributing_to_documentation/docs_presentation.po
Languages: es

source: Contributing to PyMC documentation
es: Documentación de contribución a PyMC

source: An overview of PyMC documentation
es: Una descripción general de la documentación de PyMC

source: The PyMC documentation is generated from two different GitHub repositories, each containing different type of documentation:
es: La documentación de PyMC se genera a partir de dos repositorios de GitHub diferentes, cada uno de los cuales contiene un tipo diferente de documentación:

source: [pymc](https://github.com/pymc-devs/pymc): The pymc repository contains most reference content in the form of docstrings (strings attached to the Python object they describe), some guides about core functionality and the contributing docs.
es: [pymc](https://github.com/pymc-devs/pymc): El repositorio de pymc contiene la mayor parte del contenido de referencia en forma de docstrings (cadenas adjuntas al objeto de Python que describen), algunas guías sobre la funcionalidad principal y los documentos de contribución.

source: [pymc-examples](https://github.com/pymc-devs/pymc-examples): The pymc-examples repository contains a collection of over 90 notebooks with usage examples, in depth-explanations and tutorials about PyMC.
es: [pymc-examples](https://github.com/pymc-devs/pymc-examples): El repositorio pymc-examples contiene una colección de más de 90 notebooks con ejemplos de uso, explicaciones detalladas y tutoriales sobre PyMC.

source: In this talk, we'll focus on contributing to pymc-examples, which contains more and more diverse documentation. We'll start with a description of the resource, its features and how they relate to our pedagogical goals and then dive into using those features to write clear, pretty and well referenced technical documentation.
es: En esta charla, nos centraremos en contribuir a pymc-examples, que contiene documentación cada vez más diversa. Comenzaremos con una descripción del recurso, sus características y cómo se relacionan con nuestros objetivos pedagógicos y luego nos sumergiremos en el uso de esas características para escribir documentación técnica clara, bonita y bien referenciada.

source: The idea: an executable book made from blogposts
es: La idea: un libro ejecutable hecho a partir de blogs

source: We won't explain how to set up a similar website, this would take another whole talk.
es: No explicaremos cómo configurar un sitio web similar, esto tomaría otra charla completa.

source: We will give an overview of the features available and about why we chose those to then dive into our main goal for the talk: _How do you as a contributor to PyMC documentation take advantage of them_
es: Daremos una descripción general de las funciones disponibles y de por qué las elegimos para luego profundizar en nuestro objetivo principal de la charla: _¿Cómo puedes, como persona que colabora a la documentación de PyMC, aprovecharlas?_

source: Our wishlist:
es: Nuestra lista de deseos:

source: Easy to write
es: Fácil de escribir

source: Easy to execute, both when writing pages and when reading them. We should be able to run the code years from now.
es: Fácil de ejecutar, tanto al escribir páginas como al leerlas. Deberíamos poder ejecutar el código dentro de unos años.

source: Browsable via tags and categories
es: Navegable a través de etiquetas y categorías

source: Searchable by itself and searchable from the pymc library documentation
es: Se puede buscar por sí mismo y se puede buscar en la documentación de la biblioteca pymc

source: Citable resource
es: Recurso citable

source: Acknowledge the authors (without making it the focus)
es: Reconocer a las personas autoras (sin convertirlo en el foco)

source: Automatic table of contents
es: Índice automático

source: Accessible
es: Accesible

source: DRY: do not repeat yourself. Things shared between several notebooks should be done once when possible.
es: DRY: no te repitas (de sus siglas en inglés). Las cosas compartidas entre varios notebooks deben hacerse una vez cuando sea posible.

source: The implementation: jupyter notebook + sphinx (+ extensions)
es: La implementación: jupyter notebook + sphinx (+ extensiones)

source: supported via sphinx+myst-parser
es: suportado a través de sphinx+myst-parser

source: Jupyter notebook combined with binder and google colab badges on top of every page
es: Jupyter notebook combinado con Binder e insignias de Google colab en la parte superior de cada página

source: supported via sphinx+myst-nb and a custom html template for the badges
es: soportado a través de sphinx+myst-nb y una plantilla html personalizada para las insignias

source: the environment used to run them is stored automatically thanks to the watermark library
es: el entorno usado para ejecutarlos se almacena automaticamente gracias a la libreria watermark

source: supported via sphinx+ablog
es: soportado a traves de sphinx+ablog

source: supported via sphinx+pydata-sphinx-theme+readthedocs
es: soportado a través de sphinx+pydata-sphinx-theme+readthedocs

source: supported via zenodo+custom template
es: soportado a través de zenodo+una plantilla personalizada

source: supported via ablog+custom template
es: soportado a través de ablog+una plantilla personalizada

source: supported via sphinx+pydata-sphinx-theme
es: soportado a través de sphinx+pydata-sphinx-theme

source: pydata-sphinx-theme is working on the accessibility of the theme and will continue to do so
es: El equipo de pydata-sphinx-theme está trabajando en la accesibilidad del tema y seguirá trabajando en ello

source: Centralized citations thanks to sphinx-bibtex, they are referenced in the docs with 2 keywords
es: Citaciones centralizadas gracias a sphinx-bibtex, se referencian en la documentación usando dos palabras clave.

source: Badges are automatic
es: Las medallas son automáticas.

source: Tags and categories are automatic
es: Las etiquetas y categorías son automáticas.

source: Table of contents is automatic
es: La tabla de contenidos se genera de forma automática

source: The 2 last sections with license info and citation are generated from a centralized source, with only 2 lines needed per notebook
es: Las 2 últimas secciones con la información de licencias y citaciones se generan a partir de una fuente centralizada, y solo se necesitan 2 líneas por cuaderno

source: To sum up, thanks to the work of several amazing people (both seasoned PyMC contributors and new members working with us via Outreachy and {abbr}`GSoD (Google Season of Docs)`) and the funds we raised during [PyMCon](https://discourse.pymc.io/c/pymcon/2020talks/15) and GSoD we have changed most of our documentation infrastructure in the last 9 months.
es: En resumen, gracias al trabajo de varias personas asombrosas (tanto contribuidores de PyMC con experiencia como nuevos integrantes que trabajan con nosotros mediante Outreachy y {abbr}`GSoD (Google Season of Docs)`) y a los fondos que conseguimos durante [PyMCon](https://discourse.pymc.io/c/pymcon/2020talks/15) y GSoD, cambiamos la mayoría de nuestra infraestructura de documentación en los últimos 9 meses.

source: You can see a huge change already:
es: Desde ya puedes ver un cambio enorme:

source: background image
es: imagen de fondo

source: The problem: too much docs?
es: El problema: ¿demasiada documentación?

source: Our **infrastructure** supports all of the points above, but only a handful of notebooks have been updated to take advantage of them. So while we _could_ have all that, we are still far from there!
es: Nuestra **infraestructura** soporta todos los aspectos descritos arriba, pero solo unos cuantos cuadernos han sido actualizados para aprovecharlos. Así que, aunque _podríamos_ tener todo eso, aún estamos lejos de lograrlo.

source: MyST: Markedly Structured Text
es: MyST: Texto Marcadamente Estructurado (del inglés, Markedly Structured Text)

source: As we have just said, we have already configured the infrastructure for all the points above, so you don't need to worry about that. The rest of the webinar will be a myst quickstart targetted to contributing to pymc-examples.
es: Como lo acabamos de decir, ya configuramos la infraestructura para todos los aspectos descritos arriba, así que no tienes que preocuparte por eso. El resto del webinar será una guía para empezar a trabajar con MyST diseñada para contribuir a los ejemplos de PyMC.

source: Core markup
es: Marcado principal

source: MyST is a superset of ✨✨ **Markdown** ✨✨. Everything you know and love about markdown is valid MyST markup: italics, code blocks, links, headers, lists...
es: MyST es un súperconjunto de ✨✨ **Markdown** ✨✨. Todo lo que conoces y te encanta de Markdown funciona en MyST: cursivas, blosques de código, enlaces, encabezados, listas...

source: However, markdown is too limited for technical writing and for resources containing many files. MyST fills this gap by bringing to markdown all the features of restructured text, a similar markup language designed for technical documentation. It does so by extending markdown with a few custom idioms and by supporting roles and directives (covered in the following subsections).
es: Sin embargo, Markdown tiene muchas limitaciones para la escritura técnica y para recursos que contienen muchos archivos. MyST cierra esta brecha trayendo a Markdown todas las características del texto re-estructurado, un lenguaje de marcado diseñado para escribir documentación técnica. Esto se logra extendiendo Markdown con unas cuantas expresiones personalizadas y soportando roles y directivas (las cuales cubriremos en las siguientes subsecciones).

source: **Targets**
es: **Blancos**

source: Targets are used to define custom anchors that you can refer to elsewhere in your documentation using roles. They generally go before section titles, but they can also point to lists or specific bullet points within a list.
es: Los blancos se utilizan para definir anclas personalizadas que pueden referir a otras partes de la documentación a partir de roles. Generalmente van antes de los títulos de las secciones, pero también pueden apuntar a listas o a elementos específicos dentro de una lista.

source: Targets are creating with `(target_id)=` right before the section or item we want them to point to. You can see the equal at the end as an indicator that we are making the target id equivalent to what comes after. Thus, referencing the target id becomes the same as referencing a section header or bullet point.
es: Los blancos se crean colocando `(target_id=)` justo antes de la sección o elemento al que deseamos que apunte. Puedes ver el signo igual al final como un indicador de que haremos que el identificador de blanco sea equivalente a lo que viene después. Así pues, referenciar el id del blanco se vuelve lo mismo que referenciar un encabezado de sección o un elemento de una lista.

source: **Math**
es: **Matemáticas**

source: Like Jupyter notebooks, MyST supports using `$` for inline latex math expressions, and `$$` for block expressions. Moreover, block mathematical expressions can be given ids in order to reference them elsewhere using roles. Thus:
es: Al igual que los cuadernos de Jupyter, MyST soporta usar el símbolo `$` para escribir expresiones matemáticas de LaTeX dentro de un párrafo, y `$$` para expresiones en bloque independientes. Además, a la expresiones matemáticas en bloque se les pueden asignar identificadores para referenciarlos en otras partes usando roles. Así pues:

source: renders as:
es: se renderiza así:

source: and can be referenced.
es: y puede referenciarse.

source: Roles provide a way to specify arbitrary **inline** features. Their base syntax is `` {role-name}`role-content` `` and can be divided in two subgroups: cross-referencing and formatting roles, with the cross-referencing use being far more important.
es: Los roles son una forma de especificar características **inline** arbitrarias. Su sintaxis básica es `` {role-name}`role-content` `` y se puede dividir en dos grupos: roles con referencias cruzadas y roles de formateo. El uso con referencias cruzadas es por mucho el más importante.

source: Cross-referencing roles
es: Roles para referencias cruzadas

source: Cross-referencing roles can be used in two ways:
es: Los roles para referencias cruzadas se pueden usar de dos maneras:

source: `` {role-name}`custom text for link <target>` ``
es: `` {role-name}`texto personalizado para el enlace <target>` ``

source: `ref` and `numref` role is used to link to manually created targets, with `(id)=`, in figures... `ref` is replaced by the title of what we are linking to, `numref` (not valid for all objects) is replaced by its count.
es: Los roles `ref` y `numref` se usan para enlazar con blancos creados manualmente, con `(id)=`. En las figuras `ref` es remplazado por el título de lo que sea que estemos enlazando. Por otra parte, `numref` (que no es válido para todos los tipos de objeto) se remplaza por su conteo.

source: `doc` role is used to link using the path to a file
es: el rol `doc` se usa para enlazar usando la ruta de un archivo

source: `term` role is used to link to terms defined in {ref}`our glossary <pymc:glossary>`.
es: el rol `term` se usa para enlazar a términos definidos en {ref}`nuestro glosario <pymc:glossary>`.

source: python domain references: `mod` (module), `func` (function), `class` or `meth` (method) are used to link to python objects documented in the {ref}`pymc:api`.
es: Referencias de dominio de Python: `mod` (módulo), `func` (función), `class` o `meth` (método) se usan para enlazar con los objetos de Python documentados en la {ref}`pymc:api`.

source: These can also take a `~` character before the import path to show only the object, not its import path.
es: Estos también pueden recibir un carácter `~` antes de la ruta de importación para mostrar solo el objeto y no la ruta.

source: bibtex citation: `cite:p` and `cite:t` are used to cite the scientific literature and tell sphinx to keep a log of citations so we can generate the biblography automatically.
es: Citación de bibtex: `cite:p` y `cite:t` se usan para citar publicaciones científicas y decirle a sphinx que mantenga un registro de citaciones para poder generar la bibliografía de manera automática.

source: `eq` for equation targets
es: `eq` para blancos de ecuaciones

source: **Examples**
es: **Ejemplos**

source: `` {ref}`docs/idea` `` is rendered as {ref}`docs/idea` and points to a title
es: `` {ref}`docs/idea` `` se renderiza como {ref}`docs/idea` y apunta a un título

source: `` {ref}`the idea <docs/idea>` `` is rendered as {ref}`the idea <docs/idea>` and points to a title
es: `` {ref}`la idea <docs/idea>` `` se renderiza como {ref}`la idea <docs/idea>` y apunta a un título

source: `` {eq}`eq:bayes` `` is rendered as {eq}`eq:bayes` and points to an equation
es: `` {eq}`eq:bayes` `` se renderiza como {eq}`eq:bayes` y apunta a una ecuación

source: `` {ref}`pymc-examples bullet point <docs/pymc-examples-point>` `` is rendered as {ref}`pymc-examples bullet point <docs/pymc-examples-point>`, and points to a bullet point using a custom text for the link. Here as we link to a bullet point we need to use custom text, sphinx can't use the title itself as link text.
es: `` {ref}`Elemento de lista de ejemplos de PyMC <docs/pymc-examples-point>` `` se renderiza como {ref}`Elemento de lista de ejemplos de PyMC <docs/pymc-examples-point>` y apunta a un elemento de una lista por medio de un texto personalizado para el enlace. Aquí, cuando queremos enlazar a un elemento de una lista, tenemos que usar un texto personalizado, ya que sphinx no puede usar el título como tal como un texto con enlace.

source: `` {class}`pymc.Normal` `` is rendered as {class}`pymc.Normal` and points to the documentation of the Normal class in PyMC
es: `` {class}`pymc.Normal` `` se renderiza como {class}`pymc.Normal` y apunta a la documentación de la clase Normal en PyMC

source: `` {class}`~pymc.Normal` `` is rendered as {class}`~pymc.Normal` and also points to the documentation of the Normal class in PyMC, but showing on `Normal`.
es: `` {class}`~pymc.Normal` `` se renderiza como {class}`~pymc.Normal` y también apunta a la documentación de la clase Normal en PyMC, pero se muestra en `Normal`.

source: `` {class}`normal distribution <pymc.Normal>` `` is rendered as {class}`normal distribution <pymc.Normal>` and again, also points to the documentation of the Normal class in PyMC but showing custom text.
es: `` {class}`distribución normal <pymc.Normal>` `` se renderiza como {class}`distribución normal <pymc.Normal>` y, de nuevo, también apunta a la documentación de la clase Normal en PyMC, pero mostrando texto personalizado.

source: `` {term}`pymc:posterior` `` is rendered as {term}`pymc:posterior` and points to the posterior definition in the glossary.
es: `` {term}`pymc:posterior` `` se renderiza como {term}`pymc:posterior` y apunta a la definición de posterior en el glosario.

source: We can also use cross references for external links. In such cases, the target needs to be prepended by the external website id, we do this with our term cross reference, indicating it should point to the PyMC docs.
es: También podemos usar referencias cruzadas con los enlaces externos. En esos casos, el blanco debe llevar antes el identificador del sitio web externo. Esto lo hacemos con nuestra referencia cruzada para el término, con la que indicamos que debería apuntar a la documentación de PyMC.

source: If the target doesn't exist in the current website nor it is repeated among the external websites we have configured we can skip this prefix. We can therefore skip the prefix safely for links to python objects, and we have, the import path is already unique.
es: Si el blanco no existe en el sitio web actual ni se repite entre los sitios web externos que hemos configurado, nos podemos saltar este prefijo. Así pues, nos podemos saltar sin problemas los prefijos para los enlaces a objetos de python, y veremos que la ruta de importación ya es única.

source: Formatting roles
es: Roles de formateo

source: `abbr` for abbreviations: {abbr}`PPL (Probabilistic Programming Language)`
es: `abbr` para abreviaciones: {abbr}`PPL (lenguaje de programación probabilístico, del inglés Probabilistic Programming Language)`

source: `bdg-<style>` for badges: {bdg-warning}`caution`. [Reference](https://sphinx-design.readthedocs.io/en/furo-theme/badges_buttons.html#badges) for valid styles.
es: `bdg-<style>` para medallas: {bdg-warning}`caution`. [Referencia](https://sphinx-design.readthedocs.io/en/furo-theme/badges_buttons.html#badges) para estilos válidos.

source: `octicon` for [octicon](https://sphinx-design.readthedocs.io/en/furo-theme/badges_buttons.html#inline-icons) icons: {octicon}`bookmark`
es: `octicon` para íconos [octicon](https://sphinx-design.readthedocs.io/en/furo-theme/badges_buttons.html#inline-icons): {octicon}`bookmark`

source: `fas`, `fab` and `far` for Font Awesome icons: {fas}`dragon`
es: `fas`, `fab` y `far` para íconos de Font Awesome: {fas}`dragon`

source: Directives
es: Directivas

source: Directives provide a way to specify arbitrary **block/paragraph** features. They are much more diverse and flexible than roles. Their base syntax is:
es: Las directivas son una manera de especificar características arbitrarias de **bloque/párrafo**. Son mucho más diversas y flexibles que los roles. Su sintaxis básica es:

source: Out of the 4 blocks (name, argument, keyword arguments and content), only the name is always required. Each directive has its own rules and required (or even forbidden sometimes) blocks.
es: De los 4 bloques (nombre, argumento, argumentos de palabra clave y contenido), solo se requiere el nombre siempre. Cada directiva tiene sus propias reglas y bloques requeridos (o incluso prohibidos en algunas ocasiones).

source: Figure
es: Figuras

source: MyST provides a `figure-md` directive where we can add images with an id and a caption that gets rendered both in pure markdown (unrendered notebook) and in the website (where it looks nicer).
es: MyST proporciona una directiva `figure-md` donde podemos añadir imágenes con un identificador y una leyenda que se renderiza tanto en markdown puro (cuaderno no renderizado) y en el sitio web (donde luce mejor).

source: The image shows two venn diagrams. The left side describes the imposter syndrome.There is a big yellow circle labeled"what I think others know", inside it has a small blue circle labeled "What I know".The right side describes the reality. The blue circle stays the same, but now,it is instead surrounded by many yellow circles of the same size that combinedcover the same area as the big yellow circle in the previous diagram. Now eachyellow circle represents what someone else knows, with no circle being smaller thanthe other.
es: La imagen muestra dos diagramas de venn. El lado izquierdo describe el síndrome de impostor. Hay un círculo amarillo grande etiquetado como "lo que pienso que otros saben", dentro tiene un círculo pequeño azul etiquetado como "lo que sé". El lado derecho describe la realidad. El círculo azul se mantiene igualm pero aora está rodeado por muchos círculos amarillso del mismo tamaño que, cuando se combinan, cubren la misma área que el círculo amarillo grande en el diagrama anterior. Ahora, cada círculo amarillo representa lo que alguien más sabe, sin que ningún círculo sea más pequeño que los demás.

source: [Image by David Whittaker](https://twitter.com/rundavidrun/status/587671657193455616)
es: [Image de David Whittaker](https://twitter.com/rundavidrun/status/587671657193455616)

source: We really like the image in {numref}`imposter` and decided to use it here because we think that pymc-examples is a crystallization of this image. Nobody within the PyMC team know everything covered in the examples, the collection of examples was built by developers, power users, first time contributors and progressively ended up covering more and more, just like the yellow circles in the right diagram.
es: Nos gusta mucho la imagen en {numref}`imposter` y decidimos usarla aquí porque creemos que los ejemplos de PyMC están representados por esta imagen. Nadie en el equipo de PyMC sabe todo lo que se cubre en los ejemplos; la colección de ejemplos fue construida por los desarrolladores, usuarios expertos y los primeros contribuidores, y progresivamente empezó a cubrir más y más, justo como los círculos amarillos en el diagrama derecho.

source: It is also a wink to [Melissa's talk about sphinx](https://www.youtube.com/watch?v=tXWscUSYdBs) which you should look if you are interested in setting sphinx up for your project.
es: También es un guiño a la [charla de Melissa sobre sphinx](https://www.youtube.com/watch?v=tXWscUSYdBs), al que deberías echarle un vistazo si te interesa configurar sphinx para tu proyecto.

source: Admonitions
es: Advertencias

source: Admonitions provide a way to highlight a block of content with special relevance. You can use it for warnings, tips or notes. The complete list of admonition styles are available at the [jupyterbook website](https://jupyterbook.org/reference/cheatsheet.html#admonitions)
es: Las advertencias son una forma de resaltar un bloque de contenido de especial relevancia. Puedes usarlas para advertencias, consejos o notas. La lista completa de estilos de avertencia está disponible en el [sitio web de jupyterbook](https://jupyterbook.org/reference/cheatsheet.html#admonitions)

source: Use admonitions for content you don't want readers to miss, even if skimming only, chances are they will stop at the admonition blocks.
es: Usa advertencias para el contenido que no quieres que tus lectores se pierdan; incluso si solo están ojeando, es probable que se detengan en los bloques de advertencia.

source: And more!
es: ¡Y mucho más!
