Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/about/contributing_to_documentation/index.po
Languages: es

source: Presentation material
es: Materiales de la presentación

source: Contributing to PyMC Documentation
es: Documentación para contribuir a PyMC

source: Event
es: Evento

source: The best software libraries of the world are severely restrictive and inaccessible if they are not properly documented, resulting in few or no users. PyMC has an extensive documentation corpus with examples of all kinds which has been built since its initial release back in 2015! In this webinar we’ll explain how to contribute to PyMC documentation to update it to our new infrastructure built during the last 8 months thanks to Outreachy and GSoD (Google Season of Docs).
es: Las mejores librerías de software del mundo son bastante restrictivas e inacesibles cuando no están documentadas de manera adecuada, lo que resulta en que tengan pocos o ningún usuario. ¡PyMC tiene un corpus de documentación extenso con ejemplos de todo tipo que se ha ido construyendo desde su primera versión en 2015! En este webinar, vamos a explicar cómo contribuir a la documentación de PyMC para ponerla al dia con la nueva infraestructura que se ha construido durante los últimos 8 meses gracias a Outreachy y a GSoD (Google Season of Docs).

source: You'll learn how to use MyST (a superset of Markdown) to write technical documentation, to use multiple types of cross-references, to add beautiful styling elements, figures with captions... all while using executable Jupyter notebooks!
es: Vas a aprender cómo usar MyST (un superconjunto de Markdown) para escribir documentación técnica, utilizar distintos tipos de referencias cruzadas, añadir hermosos elementos de estilo y figuras con leyendas... ¡todo utilizando cuadernos de Jupyter ejecutables!

source: Details
es: Detalles

source: Audience: People who are interested in contributing to PyMC documentation
es: Audiencia: personas que estén interesadas en contribuir a la documentación de PyMC

source: Requirements: Markdown
es: Requisitos: Markdown

source: [Github Repo](https://github.com/pymc-devs/pymc-data-umbrella)
es: [Repositorio de Github](https://github.com/pymc-devs/pymc-data-umbrella)

source: All the content is available on this website, which is built with the same tools we use for PyMC documentation.
es: Todo el contenido está disponible en este sitio web, que fue construido con las mismas herramientas que usaremos para la documentación de PyMC.

source: Go to the webinar material!
es: Ir a los materiales del webinar

source: Pre-reqs
es: Pre-requisitos

source: Being comfortable writing and formatting with Markdown is necessary, being familiar with Jupyter is strongly recommended.
es: Es necesario tener experiencia en escribir y formatear con Markdown, se recomienda bastante tener familiaridad con Jupyter.

source: Speaker
es: Ponente

source: Oriol Abril Pla is a Bayesian statistics and open source software enthusiast currently pursuing a PhD in Computer Science at Helsinki University. He is also a member of the ArviZ and PyMC teams, where he dedicates most of his efforts to documentation and community management.
es: Oriol Abril Pla es un entusiasta de la estadística Bayesiana y del software de código abierto. Actualmente se encuentra haciendo un PhD en Ciencias de Computación en la Universidad de Helsinki. Es también miembro de los equipos de ArviZ y PyMC, en los que dedica la mayoría de su tiempo a la documentación y la administración de la comunidad.

source: Personal website: https://oriolabrilpla.cat
es: Sitio web personal: https://oriolabrilpla.cat

source: Video
es: Vídeo
