Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/about/intuitive_modeling/index.po
Languages: es

source: Intuitive Bayesian Modeling with PyMC
es: Modelado Bayesiano intuitivo con PyMC

source: Event
es: Evento

source: In this task Oriol gives an overview of PyMC, and why it is beneficial to supercharge your data science skills with probabilistic programming. The presentation is organized by layers from more generic to more specific. The following are covered: the main features of the Bayesian paradigm, probabilistic progamming, PyMC and finishing by covering some hands on examples of Bayesian modeling with PyMC.
es: En esta actividad Oriol da un vistazo general a PyMC y habla sobre por qué es bueno potenciar tus habilidades de ciencia de datos con la programación probabilística. La presentación está organizada en capaz que van de lo genérico a lo específico. Cubre lo siguiente: las principales características del paradigma Bayesiano, la programación probabilística, PyMC, y, por último, algunos ejemplos prácticos de cómo usar PyMC para hacer modelado Bayesiano.

source: Details
es: Detalles

source: Audience: People who are interested in probabilistic programming.
es: Audiencia: personas interesadas en la programación probabilística.

source: This is a beginner-level presentation. It is helpful to have some knowledge of python and statistics/data science.
es: Esta es una presentación para principiantes. Es útil tener algo de conocimiento de Python y de estadística/ciencia de datos.

source: [Github Repo](https://github.com/OriolAbril/pymc3-data_umbrella)
es: [Repositorio de GitHub](https://github.com/OriolAbril/pymc3-data_umbrella)

source: [Slides for the presentation](https://oriolabril.github.io/pymc3-data_umbrella/)
es: [Diapositivas para la presentación](https://oriolabril.github.io/pymc3-data_umbrella/)

source: Speaker
es: Ponente

source: [Oriol Abril Pla](https://oriolabrilpla.cat/) is a Bayesian statistics and open source sofware enthusiast currently pursuing a PhD in Computer Science at Helsinki Uni. He is also a member of the ArviZ and PyMC teams.
es: [Oriol Abril Pla](https://oriolabrilpla.cat/) es un entusiasta de la estadística Bayesiana y del software de código abierto. Actualmente se encuentra haciendo un PhD en ciencias de la computación en la Universidad de Helsinki. Es también miembro de los equipos de ArviZ y PyMC.

source: Video
es: Vídeo
