Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/2022-07_sprint/sprint_parties/media_kit.po
Languages: pt

source: Social Media Kit
pt: Kit de mídia social

source: Event Hashtag
pt: Hashtag do evento

source: This is our official hashtag and can be used on social media (Twitter, LinkedIn, Instagram, etc.)
pt: Esta é a nossa hashtag oficial e pode ser utilizada nas redes sociais (Twitter, LinkedIn, Instagram, etc.)

source: Social Media Accounts
pt: Contas de mídia social

source: Organization
pt: Organização

source: N/A
pt: N/D

source: Share Our Events
pt: Compartilhe nossos eventos

source: Our event series can be shared in one or more of the following ways:
pt: Nossa série de eventos pode ser compartilhada de uma ou mais das seguintes maneiras:

source: Event website: https://pymc-data-umbrella.xyz/en/latest/
pt: Site do evento: https://pymc-data-umbrella.xyz/en/latest/

source: Event registration form: https://tinyurl.com/du-pymc-os-ws
pt: Formulário de inscrição do evento: https://tinyurl.com/du-pymc-os-ws

source: Social media card: https://raw.githubusercontent.com/pymc-devs/pymc-data-umbrella/main/_static/banner_2022_07/2022_07_banner_1280×640px.png
pt: Cartão de mídia social: https://raw.githubusercontent.com/pymc-devs/pymc-data-umbrella/main/_static/banner_2022_07/2022_07_banner_1280×640px.png

source: Meetup event: can share links or cross-post the event with your Meetup group
pt: Evento Meetup: pode compartilhar links ou publicar o evento com seu grupo Meetup

source: Event
pt: Evento

source: Date
pt: Data

source: Time
pt: Hora

source: Duration
pt: Duração

source: MeetUp
pt: Encontro

source: Pre-series Office Hours
pt: Horário Pré-série

source: Jul 2 (Saturday)
pt: 2 de julho (Sábado)

source: 13 UTC
pt: 13 UTC / 10 Brasília

source: 1 hour
pt: 1 hora

source: Working Session #1
pt: Sessão de trabalho nº 1

source: Jul 9 (Saturday)
pt: 9 de julho (Sábado)

source: 3 hours
pt: 3 horas

source: Working Session #2
pt: Sessão de trabalho nº 2

source: Jul 22 (Friday)
pt: 22 de julho (Sábado)

source: 16 UTC
pt: 16 UTC / 13 Brasília

source: Working Session #3
pt: Sessão de trabalho nº 3

source: Aug 4/5 (Th/Fr)
pt: 4/5 de agosto (Quinta/Sexta)

source: 23 UTC
pt: 23 UTC / 20 Brasília

source: Post-series Office Hours [^1]
pt: Horário de atendimento pós-série [^1]

source: Aug 18 (Sat)
pt: 18 de agosto (Sábado)

source: Email copy (button to copy all text available at the top right of the code block)
pt: Cópia de e-mail (botão para copiar todo o texto disponível no canto superior direito do bloco de código)

source: Channels to Share
pt: Canais para compartilhar

source: Communication servers: Slack, Discord
pt: Servidores de comunicação: Slack, Discord

source: Social media: Facebook, Instagram
pt: Redes sociais: Facebook, Instagram

source: Mobile communities: WhatsApp, Telegram
pt: Comunidades móveis: WhatsApp, Telegram

source: Newsletters
pt: Boletins informativos

source: Logos
pt: Logotipos

source: **Acknowledgement**
pt: **Reconhecimento**

source: We would like to thank [Pollicy](https://pollicy.org) for sharing their [DataFest Africa](https://datafest.africa) media kit as a resource to the community.
pt: Gostaríamos de agradecer a [Pollicy](https://pollicy.org) por compartilhar seu kit de mídia [DataFest Africa](https://datafest.africa) como um recurso para a comunidade.
