Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/sprint/tutorials/environment_setup.po
Languages: es

source: Environment setup
es: Configurar el ambiente

source: Pre-requisites
es: Pre-requisitos

source: GitHub account
es: Cuenta de GitHub

source: To contribute you'll need a GitHub account. You can create one from [this link](https://github.com/join)
es: Para contribuir necesitarás una cuenta de GitHub. Puedes crear una desde [este enlace](https://github.com/join)

source: New to Git and GitHub?
es: ¿Es tu primera vez usando Git y GitHub?

source: We have tried to cover all the steps and include both input and output, to make sure you can follow this tutorial without knowing Git. However, if you want to learn about Git and understand what is going on, we recommend [this dataschool tutorial](https://www.dataschool.io/how-to-contribute-on-github/)
es: Intentamos cubrir todos los pasos e incluir tanto las entradas como las salidas para asegurarnos de que puedas seguir este tutorial sin saber Git. Sin embargo, si quieres saber sobre Git y entender lo que está pasando, te recomendamos [este tutorial de dataschool](https://www.dataschool.io/how-to-contribute-on-github/)

source: Install Git
es: Instalar Git

source: Instructions with installation commands for most Linux distributions can be found on the [Git project website](https://git-scm.com/download/linux)
es: Las instrucciones con comandos de instalación para la mayoría de distribuciones de Linux se pueden encontrar en el [sitio web del proyecto Git](https://git-scm.com/download/linux)

source: Instructions with installation commands for macosx can be found on the [Git project website](https://git-scm.com/book/en/v2/Getting-Started-Installing-Git#_installing_on_macos)
es: Las instrucciones con comandos de instalación para macosx se pueden encontrar en el [sitio web del proyecto Git](https://git-scm.com/book/en/v2/Getting-Started-Installing-Git#_installing_on_macos)

source: The recommended way to install Git is using [Git for Windows](https://git-scm.com/download/win).
es: La manera recomendada de instalar Git es usando [Git para Windows](https://git-scm.com/download/win).

source: Install conda
es: Instalar conda

source: We recommend you install miniconda and follow the steps below to install only the libraries you'll need.
es: Te recomendamos instalar miniconda y seguir los pasos descritos abajo para instalar solo las librerías que necesitarás.

source: Miniconda installation instructions for linux are available on the [conda website](https://conda.io/projects/conda/en/latest/user-guide/install/linux.html)
es: Las instrucciones para instalar miniconda en Linux están disponibles en el [sitio web de conda](https://conda.io/projects/conda/en/latest/user-guide/install/linux.html)

source: Miniconda installation instructions for macosx are available on the [conda website](https://conda.io/projects/conda/en/latest/user-guide/install/macos.html)
es: Las instrucciones para instalar miniconda en macosx están disponibles en el [sitio web de conda](https://conda.io/projects/conda/en/latest/user-guide/install/macos.html)

source: Miniconda installation instructions for windows are available on the [conda website](https://conda.io/projects/conda/en/latest/user-guide/install/windows.html)
es: Las instrucciones para instalar miniconda en Windows están disponibles en el [sitio web de conda](https://conda.io/projects/conda/en/latest/user-guide/install/windows.html)

source: Text editor
es: Editor de texto

source: You might already have a text editor installed. Check if you have any editor from the list below, otherwise install _one_, any will do:
es: Puede que ya tengas un editor de texto instalado. Revisa si tienes cualquiera de los que están en la lista de abajo, en caso contrario instala __uno__, cualquiera servirá:

source: [PyCharm (community)](https://www.jetbrains.com/pycharm/download)
es: [PyCharm (versión comunidad)](https://www.jetbrains.com/pycharm/download)

source: Fork the pymc repo
es: Haz un fork del repositorio de PyMC

source: Fork the [project repository](https://github.com/pymc-devs/pymc/) by clicking on the 'Fork' button near the top right of the main repository page.
es: Haz un fork del [repositorio del proyecto](https://github.com/pymc-devs/pymc/) haciendo clic en el botón 'Fork' cerca de la parte superior derecha de la página principal del repositorio.

source: This creates a copy of the code under your GitHub user account. You should now see that `https://github.com/<your GitHub handle>/pymc/` exists
es: Esto creará una copia del código en tu cuenta de usuario de GitHub. Ahora deberías ver que existe `https://github.com/<your GitHub handle>/pymc/`

source: Open a command line interface
es: Abre una interfaz de línea de comandos

source: This should come with your operative system or have been installed when setting up Git and miniconda.
es: Esto debería venir con tu sistema operativo o haberse instalado cuando configurabas Git y miniconda.

source: Clone the pymc repo
es: Clona el repositorio de PyMC

source: Clone your fork. This will create a `pymc` folder wherever you are, make sure to be at the location where you want the folder to be created.
es: Clona tu fork. Esto creará una carpeta `pymc` donde te encuentres, asegúrate de estar en la ubicación en la que quieres que se cree la carpeta.

source: This command should start immediately but it can take a while to finish. Its output should look similar to the prompt below (the exact numbers can change and it will be in the language or your computer which probably won't be Catalan):
es: El comando debería iniciar inmediatamente pero puede tomar un rato para terminar. Su salida debería lucir parecida a la salida que mostramos debajo (los números exactos pueden cambiar y estará en el lenguaje de tu computadora, que probablemente no sea catalán):

source: Enter inside the directory containing your local clone of the pymc repo, then tell git this is a fork of the one in the pymc-devs organization:
es: Entra a la carpeta que contiene el clon local del repositorio de PyMC, y hazle saber a git que este es un fork del que está en la organización pymc-devs:

source: None of these commands generate any output. To check they have worked type
es: Ninguno de estos comandos genera ninguna salida. Para asegurarte de que hayan funcionado, escribe:

source: and check that the output is:
es: y verifica que la salida sea:

source: Install PyMC
es: Instalar PyMC

source: This command can also take a while, but should start writing output immediately. If it finishes successfully, the last lines printed will be:
es: Este comando también puede demorarse un rato, pero debería empezar a mostrar sus resultados de inmediato. Cuando termine, las últimas líneas que imprimirá serán:

source: Activate the environment and install pymc:
es: Activa el ambiente e instala PyMC:

source: This command has no output, but generally adds the environment name to the start of the command line. If you want, you can check it has worked with the command `conda list` which should print all the packages installed, starting with:
es: Este comando no tiene salida, pero generalmente le añade el nombre del ambiente al comienzo de la linea de comandos. Si quieres, puedes revisar que haya funcionado con el comando `conda list`, que debería imprimir todos los paquetes instalados, empezando con:

source: Install PyMC:
es: Instalar PyMC:

source: We already installed all the dependencies so this should not take long. If successful, the last printed line will be
es: Ya instalamos las dependencias, así que esto no debería tomar mucho. Si todo funciona, la última línea impresa será:

source: Then activate `pre-commit`. It will help auto formatting the code for you.
es: Ahora activa `pre-commit`. Te ayudará a darle formato al código de manera automática.

source: on success will show
es: al ejecutarse de manera exitosa, te mostrará:

source: Your system is now ready! You are ready to do your first PR.
es: ¡Tu sistema está listo! Ya puedes hacer tu primer PR.

source: Go and choose an issue to work on at `TODO: add link`!
es: ¡Ahora escoge un issue en el que trabajar en `TODO: add link`!
