Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/sprint/tutorials/pr_tutorial.po
Languages: es

source: Creating a Pull Request
es: Creación de un Pull Request

source: In this guide we will be creating a pull request for the PyMC project.
es: En esta guía vamos a crear un pull request para el proyecto PyMC.

source: To follow this tutorial you will need to have your environment set up **and** have an idea of the changes you are planning to do.
es: Para seguir este tutorial necesitarás que tengas tu entorno configurado **y** la idea de los cambios que planeas hacer.

source: To set up your environment you can follow the {ref}`environment_setup` tutorial.
es: Para configurar tu entorno puedes seguir el tutorial {ref}`environment_setup`.

source: If you haven't yet chosen an issue to work on, we recommend following the {ref}`docstring_tutorial` tutorial.
es: Si aún no has elegido un issue en el que trabajar, te recomendamos que sigas el tutorial {ref}`docstring_tutorial`.

source: Create a feature branch
es: Crea una rama feature

source: and check git indicates you the branch change was successful:
es: y comprueba que git te indica que el cambio de rama se ha realizado correctamente:

source: Keep your branch names informative, use one branch per PR and **never** work on `main`.
es: Mantén tus nombres de rama informativos, usa una rama por PR y **nunca** trabajes en `main`.

source: Getting ready for the 2nd PR?
es: ¿Preparándote para el 2º PR?

source: If you haven't changed to a different branch, you'll still be in the `docstring_update` one, but you don't want to work there! Remember, one branch per PR.
es: Si no has cambiado a una rama diferente, seguirás en la de `docstring_update`, ¡pero no querrás trabajar ahí! Recuerda, una rama por PR.

source: _Before_ starting to work on the new changes, move back to main, update your local copy and then create the new branch.
es: _Antes_ de empezar a trabajar en los nuevos cambios, vuelve a main, actualiza tu copia local y luego crea la nueva rama.

source: Commit the changes to git
es: Envía los cambios a git (commit)

source: Add the changes to your local copy and give a name to the changes. Keep the name short yet informative, for example:
es: Añade los cambios a tu copia local y dales un nombre. Que el nombre sea corto pero informativo, por ejemplo:

source: pre-commit will check and fix common formatting issues, and before doing this it needs to set up. So this can take a bit.
es: pre-commit comprobará y corregirá problemas comunes de formato, y antes de hacerlo necesita configurarse. Así que esto puede tardar un poco.

source: If all the checks pass, the end of the printed output will look like:
es: Si se superan todas las comprobaciones, el final de la salida será algo parecido a:

source: If some checks fail, there are two options:
es: Si fallan algunas comprobaciones, hay dos opciones:

source: pre-commit is able to fix the file
es: pre-commit es capaz de arreglar el archivo

source: If this is the case for all fails, you only need to run the same command again, and now checks will pass:
es: Si este es el caso de todos los fallos, sólo tienes que volver a ejecutar el mismo comando, y ahora las comprobaciones pasarán:

source: pre-commit is not able to fix the file
es: pre-commit no es capaz de arreglar el archivo

source: If some fail has this message then it needs manual input. Ask on Discourse sharing this piece copied from your terminal. It needs to include the check name and all fail messages.
es: Si algún fallo tiene un mensaje de este tipo, entonces necesita entrada manual. Pregunta en Discourse compartiendo el mensaje copiado de tu terminal. Es necesario que incluyas el nombre de la comprobación y todos los mensajes de fallo.

source: Upload (push) the changes to GitHub
es: Sube (push) los cambios a GitHub

source: Then push the changes to your GitHub account with:
es: A continuación, sube (push) los cambios a tu cuenta de GitHub con:

source: The output will look like:
es: El resultado será el siguiente:

source: Create a Pull Request
es: Crea un Pull Request

source: You will have noticed that the message already indicates how to open a PR and even provides a link. Click on the link (you might need to use right click plus "Open link") and take a look at the page shown in your browser
es: Te habrás dado cuenta de que el mensaje ya indica cómo abrir un PR e incluso proporciona un enlace. Haz clic en el enlace (puede que tengas que utilizar el botón derecho del ratón más "Abrir enlace") y echa un vistazo a la página que se muestra en tu navegador

source: Your screen at this point will be similar to:
es: Tu pantalla en este punto será similar a:

source: Before clicking on the "Create pull request" button, check a couple things.
es: Antes de pulsar el botón “Crear pull request”, comprueba un par de cosas.

source: Make sure the title is informative. If you followed the advise here, it should already be as it defaults to the commit message.
es: Asegúrate de que el título sea informativo. Si has seguido los consejos aquí, ya debería serlo, ya que por defecto es el mensaje de confirmación.

source: Edit the description. You can remove all the points in the checklist except the one about the release notes. Then add a link to the issue you commented on.
es: Edita la descripción. Puedes eliminar todos los puntos de la lista de comprobación excepto el de las notas de publicación. A continuación, añade un enlace al issue que has comentado.

source: If you have taken any notes while updating the docstring add them to the PR description.
es: Si has tomado alguna nota mientras actualizabas la cadena de documentación añádela a la descripción del PR.

source: Make sure the "Allow edits and access to secrets by maintainers" button is checked (it generally is checked by default)
es: Asegúrate de que el botón “Permitir la edición y el acceso a los secretos por parte de los mantenedores” está marcado (suele estar marcado por defecto).

source: You might also see a link to the `CONTRIBUTING.md` file. You don't need to read it yet, this guide includes everything in the contributing guide that is relevant to this type of contribution. If your second PR is also on the pymc repo, then you should read the `CONTRIBUTING.md` guide there. However, if your second PR is to the pymc-examples repo instead, you have to read its (slightly different) `CONTRIBUTING.md`.
es: Puede que también veas un enlace al archivo `CONTRIBUTING.md`. No necesita leerlo todavía, esta guía incluye todo lo que hay en la guía de contribución que es relevante para este tipo de contribución. Si tu segundo PR está también en el repositorio pymc, entonces deberías leer la guía `CONTRIBUTING.md` allí. Sin embargo, si tu segundo PR está en el repositorio pymc-examples, tendrás que leer su (ligeramente diferente) `CONTRIBUTING.md`.

source: Click on "Create pull request" and celebrate for a bit 🎉, but the work is not finished.
es: Haz clic en “Crear pull request” y celébralo un poco 🎉, aunque el trabajo no ha finalizado.

source: Get ready for reviews
es: Prepárate para las revisiones

source: Now you have to wait for someone on the PyMC team to review. If you have sent the PR during session hours, we'll get to it fast (but not immediately, we might be reviewing someone else's PR!), if you are doing this ahead of the session day, it will probably take several hours before someone sees it and reviews it.
es: Ahora tienes que esperar a que alguien del equipo de PyMC lo revise. Si has enviado el PR durante el horario de la sesión, nos pondremos a ello rápidamente (pero no inmediatamente, ¡podríamos estar revisando el PR de otra persona!), si estás haciendo esto antes del día de la sesión, probablemente pasarán varias horas antes de que alguien lo vea y lo revise.

source: We'll probably make some extra comments about things to change, this is not a bad sign. We don't expect you to know everything on the first try, and also, there might be further improvements like adding some `See Also` references that require a lot of familiarity with the code base.
es: Probablemente haremos algunos comentarios extra sobre cosas que cambiar, esto no es una mala señal. No esperamos que lo sepas todo a la primera, y además, puede que haya otras mejoras como añadir algunas referencias `See Also` que requieran mucha familiaridad con el código base.

source: If you need to address some comments, you will have to modify your local copy of the files (still on the same branch). Once you are finished, commit again (same command but different message):
es: Si necesitas corregir algunos comentarios, tendrás que modificar tu copia local de los archivos (aún en la misma rama). Una vez que hayas terminado, confirma de nuevo (el mismo comando pero con un mensaje diferente):

source: Now you can push with:
es: Ahora puedes hacer push con:

source: The remote and branch name are only needed the first time. After pushing you should see that the PR on GitHub has been updated.
es: El remoto y el nombre de la rama solo se necesitan la primera vez. Después de hacer push deberías ver que el PR en GitHub ha sido actualizado.

source: Your PR will be merged as soon as possible after that and you can properly celebrate your merged PR to PyMC! Thanks for contributing!
es: ¡Tu PR será fusionado tan pronto como sea posible después de eso y podrás celebrar adecuadamente tu PR fusionado a PyMC! ¡Gracias por contribuir!
