Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/2023-03_sprint/sprint_parties/contributors.po
Languages: es

source: Contributors
es: Colaboradores

source: Add yourself as a contributor to the OS Working Session
es: Únete como colaborador a la sesión de trabajo sobre el sistema operativo

source: The template shown rendered below for the Data Umbrella logo is available here to help you copy it and add yourself to the contributor list.
es: La plantilla que se muestra a continuación para el logotipo de Data Umbrella está disponible aquí para que puedas copiarla y sumarte a la lista de colaboradores.

source: Steps to follow are only mentioned here. For an extensive tutorial you can read the page {ref}`pr_tutorial` and follow the steps mentioned below:
es: Los pasos a seguir solo se mencionan aquí. Para un tutorial más extenso puedes leer la página {ref}`pr_tutorial` y seguir los pasos que se mencionan a continuación:

source: Fork and clone the repo. You can get to the repo on GitHub with the icon on the top right of the page
es: Crea un fork y clona el repositorio. Puedes acceder al repositorio en GitHub con el icono de la parte superior derecha de la página

source: Create a feature branch.
es: Crea una rama feature.

source: Copy the contributor card template:
es: Copia la plantilla de la tarjeta de colaboración:

source: Open this file: `2023-03_sprint/sprint_parties/contributors.md`
es: Abre este archivo: `2023-03_sprint/sprint_parties/contributors.md`

source: Paste the template to the relevant section and update it with your personal info.
es: Pega la plantilla en la sección correspondiente y actualízala con tus datos personales.

source: Copy everything. The opening and closing _3 colon fences_ (`:::`) are necessary
es: Copia todo. Los _3 dos puntos_ de apertura y cierre (`:::`) son necesarios

source: Paste your card **under** the last card available (that is, after the last `:::`) but **above** the end of the grid (that is, before the one with 4 colons `::::`)
es: Pega tu tarjeta **debajo** de la última tarjeta disponible (es decir, después del último `:::`) pero **por encima** del final de la cuadrícula (es decir, antes de la que tiene 4 dos puntos `::::`)

source: Empty lines are important for rendering. The empty line between "Contributor Name" and "Contributor Location" places them in different lines when rendering. The _lack_ of empty line between the multiple icons places them in the same line when rendering the website.
es: Las líneas vacías son importantes para la renderización. La línea vacía entre "Nombre del colaborador" y "Ubicación del colaborador" los coloca en líneas diferentes al renderizar. La _ausencia_ de línea vacía entre los múltiples iconos los coloca en la misma línea al renderizar el sitio web.

source: The image can be added to the repo ([`_static/contributors_2023_03` folder](https://github.com/pymc-devs/pymc-data-umbrella/tree/main/_static/contributors_2023_03)) as part of the PR or be an external link like in the template. But it needs to be a _square image_.
es: La imagen puede añadirse al repositorio ([`_static/contributors_2023_03` folder](https://github.com/pymc-devs/pymc-data-umbrella/tree/main/_static/contributors_2023_03)) como parte del PR o ser un enlace externo como en la plantilla. Pero tiene que ser una _imagen cuadrada_.

source: If you do not want to share a website, GitHub, Twitter and/or LinkedIn, those lines can be deleted, keeping an eye on not leaving empty lines between icons+links.
es: Si no deseas compartir un sitio web, GitHub, Twitter o LinkedIn, se pueden eliminar esas líneas, procurando no dejar líneas vacías entre iconos+enlaces.

source: Commit your changes and open a Pull Request
es: Confirma tus cambios y abre un Pull Request

source: Returning Contributors
es: Colaboradores que regresan

source: Returning contributors have previously participated in a Data Umbrella or PyMC open source event or have previously contributed to PyMC.
es: Los colaboradores que regresan han participado previamente en un evento de código abierto de Data Umbrella o PyMC o han contribuido previamente a PyMC.

source: Image for contributor template
es: Imagen para la plantilla de colaboración

source: Berlin, Germany
es: Berlín, Alemania

source: New Contributors
es: Nuevos colaboradores
