Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/about/contributing_to_pymc/index.po
Languages: pt

source: Contributing to PyMC
pt: Contribuindo para o PyMC

source: Event
pt: Evento

source: From first time contributor to project maintainer. What is it like? In this testimonial, Ricardo Vieira revisits the steps of his first ever contributions to Open Source Software, to the PyMC library. He then jumps one year into the present and shows what reviewing someone else’s first time contribution looks like. Hopefully, this will help demystify open source contributions without taking any of the magic out of them! This presentation was described as "inspiring and authentic".
pt: De contribuidor pela primeira vez até mantenedor de projeto. Como se dá? Nesse testimonial, Ricardo Vieira revisita os passos de suas primeiras contribuições para Softwares Open Source, mais especificamente para a biblioteca do PyMC. Ele então avança um ano até o presente e nos mostra como é revisar a primeira contribuição de alguém. Esperamos que isso ajude a desmistificar as contribuições de open source sem tirar a mágica delas! Esta apresentação foi descrita como "inspiradora e autêntica".

source: Details
pt: Detalhes

source: Audience: People who are interested in contributing to Open source
pt: Audiência: Pessoas interessadas em contruibuir para projetos Open Source

source: [Github Repo](https://github.com/pymc-devs/pymc-data-umbrella)
pt: [Repo no Github](https://github.com/pymc-devs/pymc-data-umbrella)

source: [Slides](https://pymc-data-umbrella.xyz/en/latest/about/contributing_to_pymc/contributing_to_pymc_slides.pdf)
pt: [Apresentação](https://pymc-data-umbrella.xyz/en/latest/about/contributing_to_pymc/contributing_to_pymc_slides.pdf)

source: Speaker
pt: Palestrante

source: Ricardo Vieira is a PyMC developer and data scientist at PyMC Labs. He spent several years teaching himself Statistics and Computer Science at the expense of his official degrees in Psychology and Neuroscience.
pt: Ricardo Vieira é um desenvolvedor do PyMC e cientista de dados na PyMC Labs. Ele passou anos aprendendo sozinho Estatística e Ciência da Computação, deixando de lado sua graduação em Psicologia e Neurociência.

source: Video
pt: Vídeo
