Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/contributing/index.po
Languages: es

source: Contribute to the events
es: Contribuir a los eventos

source: Help us improve this website
es: Ayúdanos a mejorar este sitio web

source: If you find any errors or have any suggestions, please let us know! You can either [report an issue](https://github.com/pymc-devs/pymc-data-umbrella/issues/new) or send us a pull request.
es: Si encuentras errores o tienes alguna sugerencia, por favor haznoslo saber. Puedes [reportar un problema](https://github.com/pymc-devs/pymc-data-umbrella/issues/new) o enviarnos un pull request.

source: Click on the GitHub icon in the top right corner of the page to visit the page repo.
es: Haz clic en el ícono de GitHub en la esquina superior derecha de la página para visitar el repositorio del sitio web.

source: Fork and clone the repository.
es: Haz un fork y clona el repositorio.

source: Install the requirements.
es: Instala los paquetes requeridos.

source: Build the docs locally.
es: Genera la documentación localmente.

source: Make your changes to the documentation.
es: Haz cambios a la documentación.

source: Create your pull request.
es: Crea tu pull request.

source: You can use as reference the {ref}`PR Tutorial <pr_tutorial>` which explains how you can do a PR to PyMC.
es: Puedes utilizar como referencia el {ref}`Tutorial de PR<pr_tutorial>` , que explica cómo hacer un PR para PyMC.

source: Spread the word
es: Difundir

source: Share the announcements on social networks, within your personal networks. This will help us to reach more people.
es: Comparte los anuncios en tus redes sociales. Esto nos ayudará a alcanzar a más personas.

source: Create Tweet
es: Crear un tuit

source: There are social media links and text available in our {ref}`media_kit` with information for sharing with your network.
es: Hay enlaces de redes sociales y texto disponible en nuestro {ref}`media_kit` con información que puedes compartir en tus redes.

source: Some outreach related advise
es: Algunos consejos sobre difusión

source: Always use [https://pymc-data-umbrella.xyz](https://pymc-data-umbrella.xyz) when linking to the general series of events, use links within this domain for specific links to single events or external links (i.e. direct link to webinar or to registration form).
es: Siempre usa [https://pymc-data-umbrella.xyz](https://pymc-data-umbrella.xyz) cuando vayas a enlazar a la serie general de eventos, y usa enlaces dentro de este dominio para enlazar a eventos específicos o enlaces externos (como enlaces directos al webinar o al formulario de registro).

source: Use "events" to refer indistinctively to any event in the series, be it one of the webinars or the sprint session.
es: Usa la palabra "eventos" para referirte indistintamente a cualquier evento en la serie, ya sea uno de los webinars o la sesión de sprint.

source: Use "webinars" to refer to the webinars we are hosting in preparation of the sprint. Try to avoid "tutorials" as it can be confusing with the content of the documentation webinar. If you need some alternative to "webinar" consider using "event" or "workshop" before for example.
es: Usa la palabra "webinars" para referirte a los webinars que estamos organizando como preparación para el sprint. Intenta evitar la palabra "tutoriales" ya que puede confundirse con el contenido del webinar de documentación. Si necesitas algunas alternativas a la palabra "webinar" considera usar, por ejemplo, "evento" o "taller".

source: Language translations
es: Traducciones a otros idiomas

source: We are translating the website from English to other languages. The first couple of languages we are focusing on are Spanish and Portuguese. For more detailed instructions on how you can submit translations, see {ref}`translations`.
es: Estamos traduciendo el sitio web del inglés a otros lenguajes. Los primeros lenguajes en los que nos estamos concentrando son español y portugués. Para acceder a instrucciones más detalladas sobre como puedes enviar traducciones, ve a {ref}`translations`.

source: If you are interested in translating to another language, please open up an [issue](https://github.com/pymc-devs/pymc-data-umbrella/issues) with any suggestions.
es: Si te interesa traducir a otro lenguaje, por favor abre un [issue](https://github.com/pymc-devs/pymc-data-umbrella/issues) con tus sugerencias.
