Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/contributing/language-translations.po
Languages: es

source: Language Translations
es: Traducciones a otros idiomas

source: Requirements
es: Requerimientos

source: Transifex account (or GitHub one to log in with it)
es: Cuenta de Transifex (o una de GitHub para iniciar sesión con ella)

source: Knowledge of English
es: Conocimiento de Inglés

source: Knowledge of Spanish or Portuguese
es: Conocimiento de español o portugués.

source: About
es: Acerca

source: We are using [Transifex](https://www.transifex.com/) to manage the language translations, which provides a translation infrastructure with Sphinx. Transifex is *a global content repository with a REST API, SDKs, automation, and more so you can centrally manage your source content and translations and build amazing multilingual digital experiences for your users.*
es: Estamos utilizando [Transifex](https://www.transifex.com/) para gestionar las traducciones de idiomas, lo que proporciona una infraestructura de traducción con Sphinx. Transifex es *un repositorio de contenido global con una API REST, SDK, automatización y más para que pueda administrar de manera centralizada su contenido de origen y sus traducciones y crear increíbles experiencias digitales multilingües para sus usuarios.*

source: Languages
es: Idiomas

source: This translation is maintained by Spanish and Portuguese speakers from all around the globe. We don't want to tie it to any region in particular and we believe this is an extra value of its own diversity. You will find sections in different styles and tones, we only ask not changing the style every paragraph nor using very specific regionalisms.
es: Esta traducción es mantenida por hablantes de español y portugués de todo el mundo. No queremos vincularlo a ninguna región en particular y creemos que esto es un valor extra de su propia diversidad. Encontrarás secciones en diferentes estilos y tonos, solo te pedimos no cambiar el estilo de cada párrafo ni usar regionalismos muy específicos.

source: **Language codes**: we are using "es" and "pt" codes which are the general language codes and are not tied to any region.
es: **Códigos de idioma**: estamos usando códigos "es" y "pt", que son los códigos de idioma generales y no están vinculados a ninguna región.

source: The languages text is borrowed from: Python Documentation [Guía para contribuir en la traducción](https://python-docs-es.readthedocs.io/es/3.11/CONTRIBUTING.html#a-tener-en-cuenta).
es: El texto de los idiomas está tomado de: Documentación de Python [Guía para contribuir en la traducción](https://python-docs-es.readthedocs.io/es/3.11/CONTRIBUTING.html#a-tener-en-cuenta).

source: Workflow
es: Flujo de trabajo

source: Create a [Transifex account](https://www.transifex.com/signin/). Note: You can use your GitHub account to authenticate and log in to Transifex.
es: Cree una [cuenta Transifex](https://www.transifex.com/signin/). Nota: Puede usar su cuenta de GitHub para autenticarse e iniciar sesión en Transifex.

source: Navigate to our project website: [pymc/data-umbrella-sprints-website](https://www.transifex.com/pymc/data-umbrella-sprints-website/)
es: Navegue al sitio web de nuestro proyecto: [pymc/data-umbrella-sprints-website](https://www.transifex.com/pymc/data-umbrella-sprints-website/)

source: Click on "Editor" in the top menu which will bring you to a list of pages of the website to translate: https://www.transifex.com/pymc/data-umbrella-sprints-website/translate/
es: Haga clic en "Editor" en el menú superior que lo llevará a una lista de páginas del sitio web para traducir: https://www.transifex.com/pymc/data-umbrella-sprints-website/translate/

source: In the top menu, choose "Select a language". Current options are:
es: En el menú superior, elige "Seleccionar un idioma". Las opciones actuales son:

source: Portuguese (pt)
es: Portugués (pt)

source: Spanish (es)
es: Español (es)

source: Pages to translate is a sub-menu under "Editor." Currently, these pages are being prioritized for translation: [priority pages](https://github.com/pymc-devs/pymc-data-umbrella/issues/99)
es: Páginas para traducir es un submenú en "Editor". Actualmente, estas páginas tienen prioridad para la traducción: [páginas prioritarias](https://github.com/pymc-devs/pymc-data-umbrella/issues/99)

source: You can translate sub-sections and select "Save translation."
es: Puede traducir subsecciones y seleccionar "Guardar traducción".

source: There is GitHub Actions that is configured on this repository, which turns a translation into a pull request which is submitted to the repository. [PR #166](https://github.com/pymc-devs/pymc-data-umbrella/pull/166/files) is an example pull request.
es: Hay acciones de GitHub que están configuradas en este repositorio, lo que convierte una traducción en una solicitud de extracción que se envía al repositorio. [PR #166](https://github.com/pymc-devs/pymc-data-umbrella/pull/166/files) es un ejemplo de solicitud de extracción.

source: Translating content: volunteers needed
es: Traduciendo contenido: Se necesitan personas voluntarias

source: If you would like to volunteer for translations, please select a page. We have included a list of priority pages to translate on [Issue #99](https://github.com/pymc-devs/pymc-data-umbrella/issues/99).
es: Si deseas ser parte del voluntariado para las traducciones, selecciona una página. Hemos incluido una lista de páginas prioritarias para traducir en [Issue #99](https://github.com/pymc-devs/pymc-data-umbrella/issues/99).

source: Thank you 🙌
es: Gracias 🙌

source: Thank you for your contributions and making this website accessible to more users.
es: Gracias por sus contribuciones y hacer que este sitio web sea accesible a más usuarios.
