Repository: pymc-devs/pymc-data-umbrella
Catalog: locales/*/LC_MESSAGES/contributing/videos.po
Languages: es

source: Contribute timestamps to videos
es: Contribuir con marcas de tiempo a los videos

source: Requirements
es: Requerimientos

source: GitHub account
es: Cuenta de GitHub

source: About: why we are adding timestamps
es: Acerca de: por qué estamos agregando marcas de tiempo

source: We have a collection of videos on YouTube from PyMCon 2020 and PyMCon Web Series.
es: Tenemos una colección de videos en YouTube de PyMCon 2020 y PyMCon Web Series.

source: We are adding timestamps to the PyMC YouTube videos. When timestamps are available:
es: Estamos agregando marcas de tiempo a los videos PyMC de YouTube. Cuando las marcas de tiempo están disponibles:

source: It makes it easy for viewers to get to the part in the video they are interested in.
es: Facilita a los espectadores llegar a la parte del video que les interesa.

source: It also helps potential viewers find the video based on their search terms.
es: También ayuda a los espectadores potenciales a encontrar el video según sus términos de búsqueda.

source: Workflow
es: Flujo de trabajo

source: Complete instructions are available in [Issue 11: adding timestamps to videos](https://github.com/pymc-devs/video-timestamps/issues/11).
es: Las instrucciones completas están disponibles en [Edición 11: Agregar marcas de tiempo a videos](https://github.com/pymc-devs/video-timestamps/issues/11).
